[
    {
        "id": 1,
        "nameAr": "البخاري",
        "nameEn": "Bukhari",
        "birthDateHijri": "194",
        "deathDateHijri": "256",
        "descriptionAr": "الإمام محمد بن إسماعيل البخاري هو أحد أعظم علماء الحديث في الإسلام. وُلد في بخارى (في أوزبكستان الحالية) في عام 194 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'صحيح البخاري'، الذي يُعتبر أحد أصح الكتب بعد القرآن الكريم. توفي في عام 256 هـ. الإمام البخاري نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في بخارى. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ البخاري في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن السادسة عشرة، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان البخاري يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'صحيح البخاري' هو أشهر أعماله، ويحتوي على أكثر من 7000 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'صحيح البخاري'، كتب الإمام البخاري العديد من الكتب الأخرى مثل 'الأدب المفرد' و'التاريخ الكبير'. كان البخاري يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 256 هـ في سمرقند (في أوزبكستان الحالية) ودفن هناك. يُعتبر الإمام البخاري رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Imam Muhammad ibn Ismail al-Bukhari is one of the greatest hadith scholars in Islam. He was born in Bukhara (in present-day Uzbekistan) in 194 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sahih al-Bukhari', which is considered one of the most authentic books after the Quran. He passed away in 256 AH. Imam al-Bukhari grew up in a scholarly environment as his father was a well-known scholar in Bukhara. After his father's death, his mother took care of his upbringing and ensured his education. Al-Bukhari memorized the Quran at a young age and then moved on to study hadith. At the age of sixteen, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Bukhari had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sahih al-Bukhari' is his most famous work, containing over 7000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sahih al-Bukhari', Imam al-Bukhari wrote many other books such as 'Al-Adab Al-Mufrad' and 'Al-Tarikh Al-Kabir'. Al-Bukhari was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 256 AH in Samarkand (in present-day Uzbekistan) and was buried there. Imam al-Bukhari is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 2,
        "nameAr": "مسلم",
        "nameEn": "Muslim",
        "birthDateHijri": "206",
        "deathDateHijri": "261",
        "descriptionAr": "الإمام مسلم بن الحجاج هو أحد أعظم علماء الحديث في الإسلام. وُلد في نيسابور (في إيران الحالية) في عام 206 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'صحيح مسلم'، الذي يُعتبر أحد أصح الكتب بعد القرآن الكريم وصحيح البخاري. توفي في عام 261 هـ. الإمام مسلم نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في نيسابور. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ مسلم في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان مسلم يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'صحيح مسلم' هو أشهر أعماله، ويحتوي على أكثر من 7000 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'صحيح مسلم'، كتب الإمام مسلم العديد من الكتب الأخرى مثل 'الكنى والأسماء' و'الطبقات'. كان مسلم يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 261 هـ في نيسابور ودفن هناك. يُعتبر الإمام مسلم رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Imam Muslim ibn al-Hajjaj is one of the greatest hadith scholars in Islam. He was born in Nishapur (in present-day Iran) in 206 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sahih Muslim', which is considered one of the most authentic books after the Quran and Sahih al-Bukhari. He passed away in 261 AH. Imam Muslim grew up in a scholarly environment as his father was a well-known scholar in Nishapur. After his father's death, his mother took care of his upbringing and ensured his education. Muslim memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Muslim had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sahih Muslim' is his most famous work, containing over 7000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sahih Muslim', Imam Muslim wrote many other books such as 'Al-Kuna wa al-Asma' and 'Al-Tabaqat'. Muslim was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 261 AH in Nishapur and was buried there. Imam Muslim is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 3,
        "nameAr": "أبو داود",
        "nameEn": "Abu Dawud",
        "birthDateHijri": "202",
        "deathDateHijri": "275",
        "descriptionAr": "الإمام سليمان بن الأشعث أبو داود هو أحد أعظم علماء الحديث في الإسلام. وُلد في سجستان (في إيران الحالية) في عام 202 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'سنن أبي داود'، الذي يُعتبر أحد الكتب الستة الصحيحة في الحديث. توفي في عام 275 هـ. الإمام أبو داود نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في سجستان. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ أبو داود في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان أبو داود يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'سنن أبي داود' هو أشهر أعماله، ويحتوي على أكثر من 4800 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'سنن أبي داود'، كتب الإمام أبو داود العديد من الكتب الأخرى مثل 'المراسيل' و'الناسخ والمنسوخ'. كان أبو داود يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 275 هـ في البصرة (في العراق الحالية) ودفن هناك. يُعتبر الإمام أبو داود رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Imam Sulayman ibn al-Ash'ath Abu Dawud is one of the greatest hadith scholars in Islam. He was born in Sijistan (in present-day Iran) in 202 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sunan Abu Dawud', which is considered one of the six authentic books of hadith. He passed away in 275 AH. Imam Abu Dawud grew up in a scholarly environment as his father was a well-known scholar in Sijistan. After his father's death, his mother took care of his upbringing and ensured his education. Abu Dawud memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Abu Dawud had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sunan Abu Dawud' is his most famous work, containing over 4800 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sunan Abu Dawud', Imam Abu Dawud wrote many other books such as 'Al-Marasil' and 'Al-Nasikh wa al-Mansukh'. Abu Dawud was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 275 AH in Basra (in present-day Iraq) and was buried there. Imam Abu Dawud is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 4,
        "nameAr": "الترمذي",
        "nameEn": "Tirmidhi",
        "birthDateHijri": "209",
        "deathDateHijri": "279",
        "descriptionAr": "الإمام محمد بن عيسى الترمذي هو أحد أعظم علماء الحديث في الإسلام. وُلد في ترمذ (في أوزبكستان الحالية) في عام 209 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'سنن الترمذي'، الذي يُعتبر أحد الكتب الستة الصحيحة في الحديث. توفي في عام 279 هـ. الإمام الترمذي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في ترمذ. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ الترمذي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان الترمذي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'سنن الترمذي' هو أشهر أعماله، ويحتوي على أكثر من 4000 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'سنن الترمذي'، كتب الإمام الترمذي العديد من الكتب الأخرى مثل 'الشمائل المحمدية' و'العلل'. كان الترمذي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 279 هـ في ترمذ ودفن هناك. يُعتبر الإمام الترمذي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Imam Muhammad ibn Isa al-Tirmidhi is one of the greatest hadith scholars in Islam. He was born in Termez (in present-day Uzbekistan) in 209 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sunan al-Tirmidhi', which is considered one of the six authentic books of hadith. He passed away in 279 AH. Imam al-Tirmidhi grew up in a scholarly environment as his father was a well-known scholar in Termez. After his father's death, his mother took care of his upbringing and ensured his education. Al-Tirmidhi memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Tirmidhi had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sunan al-Tirmidhi' is his most famous work, containing over 4000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sunan al-Tirmidhi', Imam al-Tirmidhi wrote many other books such as 'Al-Shama'il al-Muhammadiyya' and 'Al-Ilal'. Al-Tirmidhi was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 279 AH in Termez and was buried there. Imam al-Tirmidhi is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 5,
        "nameAr": "النسائي",
        "nameEn": "Nasai",
        "birthDateHijri": "215",
        "deathDateHijri": "303",
        "descriptionAr": "الإمام أحمد بن شعيب النسائي هو أحد أعظم علماء الحديث في الإسلام. وُلد في نسا (في تركمانستان الحالية) في عام 215 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'سنن النسائي'، الذي يُعتبر أحد الكتب الستة الصحيحة في الحديث. توفي في عام 303 هـ. الإمام النسائي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في نسا. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ النسائي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان النسائي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'سنن النسائي' هو أشهر أعماله، ويحتوي على أكثر من 7000 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'سنن النسائي'، كتب الإمام النسائي العديد من الكتب الأخرى مثل 'السنن الكبرى' و'الضعفاء والمتروكين'. كان النسائي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 303 هـ في الرملة (في فلسطين الحالية) ودفن هناك. يُعتبر الإمام النسائي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Imam Ahmad ibn Shu'ayb al-Nasa'i is one of the greatest hadith scholars in Islam. He was born in Nasa (in present-day Turkmenistan) in 215 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sunan al-Nasa'i', which is considered one of the six authentic books of hadith. He passed away in 303 AH. Imam al-Nasa'i grew up in a scholarly environment as his father was a well-known scholar in Nasa. After his father's death, his mother took care of his upbringing and ensured his education. Al-Nasa'i memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Nasa'i had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sunan al-Nasa'i' is his most famous work, containing over 7000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sunan al-Nasa'i', Imam al-Nasa'i wrote many other books such as 'Al-Sunan al-Kubra' and 'Al-Du'afa wa al-Matrukin'. Al-Nasa'i was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 303 AH in Ramla (in present-day Palestine) and was buried there. Imam al-Nasa'i is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 6,
        "nameAr": "ابن ماجه",
        "nameEn": "Ibn Majah",
        "birthDateHijri": "209",
        "deathDateHijri": "273",
        "descriptionAr": "الإمام محمد بن يزيد ابن ماجه هو أحد أعظم علماء الحديث في الإسلام. وُلد في قزوين (في إيران الحالية) في عام 209 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'سنن ابن ماجه'، الذي يُعتبر أحد الكتب الستة الصحيحة في الحديث. توفي في عام 273 هـ. الإمام ابن ماجه نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في قزوين. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ ابن ماجه في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان ابن ماجه يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'سنن ابن ماجه' هو أشهر أعماله، ويحتوي على أكثر من 4000 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'سنن ابن ماجه'، كتب الإمام ابن ماجه العديد من الكتب الأخرى مثل 'التفسير' و'التاريخ'. كان ابن ماجه يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 273 هـ في قزوين ودفن هناك. يُعتبر الإمام ابن ماجه رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Imam Muhammad ibn Yazid Ibn Majah is one of the greatest hadith scholars in Islam. He was born in Qazvin (in present-day Iran) in 209 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sunan Ibn Majah', which is considered one of the six authentic books of hadith. He passed away in 273 AH. Imam Ibn Majah grew up in a scholarly environment as his father was a well-known scholar in Qazvin. After his father's death, his mother took care of his upbringing and ensured his education. Ibn Majah memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Ibn Majah had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sunan Ibn Majah' is his most famous work, containing over 4000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sunan Ibn Majah', Imam Ibn Majah wrote many other books such as 'Tafsir' and 'Tarikh'. Ibn Majah was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 273 AH in Qazvin and was buried there. Imam Ibn Majah is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 7,
        "nameAr": "مالك",
        "nameEn": "Malik",
        "birthDateHijri": "93",
        "deathDateHijri": "179",
        "descriptionAr": "الإمام مالك بن أنس هو أحد أعظم علماء الفقه والحديث في الإسلام. وُلد في المدينة المنورة في عام 93 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'الموطأ'، الذي يُعتبر أحد أهم الكتب في الفقه والحديث. توفي في عام 179 هـ. الإمام مالك نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في المدينة المنورة. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ مالك في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث والفقه. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان مالك يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'الموطأ' هو أشهر أعماله، ويحتوي على أكثر من 1700 حديث، منها حوالي 600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث والفقه ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'الموطأ'، كتب الإمام مالك العديد من الكتب الأخرى مثل 'الرسالة' و'المدونة'. كان مالك يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 179 هـ في المدينة المنورة ودفن هناك. يُعتبر الإمام مالك رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الفقه والحديث.",
        "descriptionEn": "Imam Malik ibn Anas is one of the greatest scholars of jurisprudence and hadith in Islam. He was born in Medina in 93 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Al-Muwatta', which is considered one of the most important books in jurisprudence and hadith. He passed away in 179 AH. Imam Malik grew up in a scholarly environment as his father was a well-known scholar in Medina. After his father's death, his mother took care of his upbringing and ensured his education. Malik memorized the Quran at a young age and then moved on to study hadith and jurisprudence. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Malik had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Al-Muwatta' is his most famous work, containing over 1700 hadiths, with around 600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and jurisprudence and is studied worldwide. In addition to 'Al-Muwatta', Imam Malik wrote many other books such as 'Al-Risala' and 'Al-Mudawwana'. Malik was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 179 AH in Medina and was buried there. Imam Malik is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest scholars of jurisprudence and hadith."
    },
    {
        "id": 8,
        "nameAr": "أحمد",
        "nameEn": "Ahmed",
        "birthDateHijri": "164",
        "deathDateHijri": "241",
        "descriptionAr": "الإمام أحمد بن حنبل هو أحد أعظم علماء الفقه والحديث في الإسلام. وُلد في بغداد في عام 164 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'مسند أحمد'، الذي يُعتبر أحد أهم الكتب في الفقه والحديث. توفي في عام 241 هـ. الإمام أحمد نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في بغداد. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ أحمد في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث والفقه. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان أحمد يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'مسند أحمد' هو أشهر أعماله، ويحتوي على أكثر من 30,000 حديث، منها حوالي 10,000 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث والفقه ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'مسند أحمد'، كتب الإمام أحمد العديد من الكتب الأخرى مثل 'الزهد' و'العلل ومعرفة الرجال'. كان أحمد يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 241 هـ في بغداد ودفن هناك. يُعتبر الإمام أحمد رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الفقه والحديث.",
        "descriptionEn": "Imam Ahmad ibn Hanbal is one of the greatest scholars of jurisprudence and hadith in Islam. He was born in Baghdad in 164 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Musnad Ahmad', which is considered one of the most important books in jurisprudence and hadith. He passed away in 241 AH. Imam Ahmad grew up in a scholarly environment as his father was a well-known scholar in Baghdad. After his father's death, his mother took care of his upbringing and ensured his education. Ahmad memorized the Quran at a young age and then moved on to study hadith and jurisprudence. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Ahmad had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Musnad Ahmad' is his most famous work, containing over 30,000 hadiths, with around 10,000 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and jurisprudence and is studied worldwide. In addition to 'Musnad Ahmad', Imam Ahmad wrote many other books such as 'Al-Zuhd' and 'Al-Ilal wa Ma'rifat al-Rijal'. Ahmad was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 241 AH in Baghdad and was buried there. Imam Ahmad is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest scholars of jurisprudence and hadith."
    },
    {
        "id": 9,
        "nameAr": "رياض الصالحين",
        "nameEn": "Riyad As-Salihin",
        "birthDateHijri": "631",
        "deathDateHijri": "676",
        "descriptionAr": "رياض الصالحين هو كتاب جمعه الإمام يحيى بن شرف النووي. وُلد الإمام النووي في نوى (في سوريا الحالية) في عام 631 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'رياض الصالحين'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 676 هـ. الإمام النووي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في نوى. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ النووي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان النووي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'رياض الصالحين' هو أشهر أعماله، ويحتوي على أكثر من 1900 حديث. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'رياض الصالحين'، كتب الإمام النووي العديد من الكتب الأخرى مثل 'الأربعون النووية' و'شرح صحيح مسلم'. كان النووي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 676 هـ في نوى ودفن هناك. يُعتبر الإمام النووي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Riyad al-Salihin is a book compiled by Imam Yahya ibn Sharaf al-Nawawi. He was born in Nawa (in present-day Syria) in 631 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Riyad al-Salihin', which is considered one of the most important books in hadith. He passed away in 676 AH. Imam al-Nawawi grew up in a scholarly environment as his father was a well-known scholar in Nawa. After his father's death, his mother took care of his upbringing and ensured his education. Al-Nawawi memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Nawawi had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Riyad al-Salihin' is his most famous work, containing over 1900 hadiths. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Riyad al-Salihin', Imam al-Nawawi wrote many other books such as 'Al-Arba'in al-Nawawiyya' and 'Sharh Sahih Muslim'. Al-Nawawi was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 676 AH in Nawa and was buried there. Imam al-Nawawi is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 10,
        "nameAr": "الأربعون النووية",
        "nameEn": "Nawawi 40",
        "birthDateHijri": "631",
        "deathDateHijri": "676",
        "descriptionAr": "الأربعون النووية هي مجموعة من الأحاديث النبوية التي جمعها الإمام يحيى بن شرف النووي. وُلد الإمام النووي في نوى (في سوريا الحالية) في عام 631 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'الأربعون النووية'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 676 هـ. الإمام النووي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في نوى. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ النووي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان النووي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'الأربعون النووية' هو أشهر أعماله، ويحتوي على 42 حديثاً نبوياً. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'الأربعون النووية'، كتب الإمام النووي العديد من الكتب الأخرى مثل 'رياض الصالحين' و'شرح صحيح مسلم'. كان النووي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 676 هـ في نوى ودفن هناك. يُعتبر الإمام النووي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "The Forty Hadith of Imam al-Nawawi is a collection of hadiths compiled by Imam Yahya ibn Sharaf al-Nawawi. He was born in Nawa (in present-day Syria) in 631 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Al-Arba'in al-Nawawiyya', which is considered one of the most important books in hadith. He passed away in 676 AH. Imam al-Nawawi grew up in a scholarly environment as his father was a well-known scholar in Nawa. After his father's death, his mother took care of his upbringing and ensured his education. Al-Nawawi memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Nawawi had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Al-Arba'in al-Nawawiyya' is his most famous work, containing 42 hadiths. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Al-Arba'in al-Nawawiyya', Imam al-Nawawi wrote many other books such as 'Riyad al-Salihin' and 'Sharh Sahih Muslim'. Al-Nawawi was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 676 AH in Nawa and was buried there. Imam al-Nawawi is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 11,
        "nameAr": "الشمائل المحمدية",
        "nameEn": "Shamail Muhammadiyah",
        "birthDateHijri": "209",
        "deathDateHijri": "279",
        "descriptionAr": "الشمائل المحمدية هو كتاب جمعه الإمام أبو عيسى محمد بن عيسى الترمذي. وُلد الإمام الترمذي في ترمذ (في أوزبكستان الحالية) في عام 209 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'الشمائل المحمدية'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 279 هـ. الإمام الترمذي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في ترمذ. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ الترمذي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان الترمذي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'الشمائل المحمدية' هو أشهر أعماله، ويحتوي على أكثر من 400 حديث. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'الشمائل المحمدية'، كتب الإمام الترمذي العديد من الكتب الأخرى مثل 'الجامع الكبير' و'الجامع الصغير'. كان الترمذي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 279 هـ في ترمذ ودفن هناك. يُعتبر الإمام الترمذي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Al-Shama'il al-Muhammadiyya is a book compiled by Imam Abu Isa Muhammad ibn Isa al-Tirmidhi. He was born in Termez (in present-day Uzbekistan) in 209 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Al-Shama'il al-Muhammadiyya', which is considered one of the most important books in hadith. He passed away in 279 AH. Imam al-Tirmidhi grew up in a scholarly environment as his father was a well-known scholar in Termez. After his father's death, his mother took care of his upbringing and ensured his education. Al-Tirmidhi memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Tirmidhi had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Al-Shama'il al-Muhammadiyya' is his most famous work, containing over 400 hadiths. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Al-Shama'il al-Muhammadiyya', Imam al-Tirmidhi wrote many other books such as 'Al-Jami' al-Kabir' and 'Al-Jami' al-Saghir'. Al-Tirmidhi was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 279 AH in Termez and was buried there. Imam al-Tirmidhi is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 12,
        "nameAr": "بلوغ المرام",
        "nameEn": "Bulugh Al-Maram",
        "birthDateHijri": "773",
        "deathDateHijri": "852",
        "descriptionAr": "بلوغ المرام هو كتاب جمعه الإمام أحمد بن علي بن حجر العسقلاني. وُلد الإمام ابن حجر في عسقلان (في فلسطين الحالية) في عام 773 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'بلوغ المرام'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 852 هـ. الإمام ابن حجر نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في عسقلان. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ ابن حجر في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان ابن حجر يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'بلوغ المرام' هو أشهر أعماله، ويحتوي على أكثر من 1500 حديث. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'بلوغ المرام'، كتب الإمام ابن حجر العديد من الكتب الأخرى مثل 'فتح الباري' و'الإصابة في تمييز الصحابة'. كان ابن حجر يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 852 هـ في القاهرة ودفن هناك. يُعتبر الإمام ابن حجر رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Bulugh al-Maram is a book compiled by Imam Ahmad ibn Ali ibn Hajar al-Asqalani. He was born in Ascalon (in present-day Palestine) in 773 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Bulugh al-Maram', which is considered one of the most important books in hadith. He passed away in 852 AH. Imam Ibn Hajar grew up in a scholarly environment as his father was a well-known scholar in Ascalon. After his father's death, his mother took care of his upbringing and ensured his education. Ibn Hajar memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Ibn Hajar had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Bulugh al-Maram' is his most famous work, containing over 1500 hadiths. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Bulugh al-Maram', Imam Ibn Hajar wrote many other books such as 'Fath al-Bari' and 'Al-Isabah fi Tamyiz al-Sahabah'. Ibn Hajar was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 852 AH in Cairo and was buried there. Imam Ibn Hajar is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 13,
        "nameAr": "الأدب المفرد",
        "nameEn": "Al-Adab Al-Mufrad",
        "birthDateHijri": "194",
        "deathDateHijri": "256",
        "descriptionAr": "الأدب المفرد هو كتاب جمعه الإمام محمد بن إسماعيل البخاري. وُلد الإمام البخاري في بخارى (في أوزبكستان الحالية) في عام 194 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'صحيح البخاري'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 256 هـ. الإمام البخاري نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في بخارى. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ البخاري في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان البخاري يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'الأدب المفرد' هو أحد أعماله الشهيرة، ويحتوي على أكثر من 1300 حديث. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'الأدب المفرد'، كتب الإمام البخاري العديد من الكتب الأخرى مثل 'التاريخ الكبير' و'التاريخ الصغير'. كان البخاري يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 256 هـ في سمرقند ودفن هناك. يُعتبر الإمام البخاري رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Al-Adab al-Mufrad is a book compiled by Imam Muhammad ibn Ismail al-Bukhari. He was born in Bukhara (in present-day Uzbekistan) in 194 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sahih al-Bukhari', which is considered one of the most important books in hadith. He passed away in 256 AH. Imam al-Bukhari grew up in a scholarly environment as his father was a well-known scholar in Bukhara. After his father's death, his mother took care of his upbringing and ensured his education. Al-Bukhari memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Bukhari had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Al-Adab al-Mufrad' is one of his famous works, containing over 1300 hadiths. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Al-Adab al-Mufrad', Imam al-Bukhari wrote many other books such as 'Al-Tarikh al-Kabir' and 'Al-Tarikh al-Saghir'. Al-Bukhari was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 256 AH in Samarkand and was buried there. Imam al-Bukhari is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 14,
        "nameAr": "الدارمي",
        "nameEn": "Darimi",
        "birthDateHijri": "181",
        "deathDateHijri": "255",
        "descriptionAr": "الإمام عبد الله بن عبد الرحمن الدارمي هو أحد أعظم علماء الحديث في الإسلام. وُلد في سمرقند (في أوزبكستان الحالية) في عام 181 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'سنن الدارمي'، الذي يُعتبر أحد الكتب الستة الصحيحة في الحديث. توفي في عام 255 هـ. الإمام الدارمي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في سمرقند. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ الدارمي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان الدارمي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'سنن الدارمي' هو أشهر أعماله، ويحتوي على أكثر من 3500 حديث، منها حوالي 1500 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'سنن الدارمي'، كتب الإمام الدارمي العديد من الكتب الأخرى مثل 'المسند' و'التاريخ'. كان الدارمي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 255 هـ في سمرقند ودفن هناك. يُعتبر الإمام الدارمي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Imam Abdullah ibn Abdul Rahman al-Darimi is one of the greatest hadith scholars in Islam. He was born in Samarkand (in present-day Uzbekistan) in 181 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sunan al-Darimi', which is considered one of the six authentic books of hadith. He passed away in 255 AH. Imam al-Darimi grew up in a scholarly environment as his father was a well-known scholar in Samarkand. After his father's death, his mother took care of his upbringing and ensured his education. Al-Darimi memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Darimi had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sunan al-Darimi' is his most famous work, containing over 3500 hadiths, with around 1500 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sunan al-Darimi', Imam al-Darimi wrote many other books such as 'Al-Musnad' and 'Al-Tarikh'. Al-Darimi was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 255 AH in Samarkand and was buried there. Imam al-Darimi is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 15,
        "nameAr": "الأربعون القدسية",
        "nameEn": "Qudsi 40",
        "birthDateHijri": "0",
        "deathDateHijri": "0",
        "descriptionAr": "الأربعون القدسية هي مجموعة من الأحاديث القدسية التي جمعها العلماء المسلمون. الأحاديث القدسية هي تلك الأحاديث التي يرويها النبي محمد صلى الله عليه وسلم عن الله تعالى. هذه الأحاديث تختلف عن الأحاديث النبوية في أنها تنسب إلى الله مباشرة. الأربعون القدسية تحتوي على 40 حديثاً قدسياً، وهي تُعتبر مرجعاً أساسياً في علم الحديث وتُدرس في جميع أنحاء العالم الإسلامي. هذه الأحاديث تتناول مواضيع متنوعة مثل التوحيد، العبادة، والأخلاق. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي.",
        "descriptionEn": "The Forty Qudsi Hadiths is a collection of sacred hadiths compiled by Muslim scholars. Qudsi hadiths are those hadiths narrated by the Prophet Muhammad (peace be upon him) from Allah Almighty. These hadiths differ from prophetic hadiths in that they are attributed directly to Allah. The Forty Qudsi Hadiths contains 40 sacred hadiths and is considered a fundamental reference in the science of hadith and is studied worldwide. These hadiths cover various topics such as monotheism, worship, and ethics. This book is considered a fundamental reference in the science of hadith and is studied worldwide."
    },
    {
        "id": 16,
        "nameAr": "الأربعون الشاه ولي الله",
        "nameEn": "Shah Waliullah 40",
        "birthDateHijri": "1114",
        "deathDateHijri": "1176",
        "descriptionAr": "الإمام شاه ولي الله الدهلوي هو أحد أعظم علماء الحديث في الإسلام. وُلد في دلهي (في الهند الحالية) في عام 1114 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'حجة الله البالغة'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 1176 هـ. الإمام شاه ولي الله نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في دلهي. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ شاه ولي الله في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان شاه ولي الله يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'حجة الله البالغة' هو أشهر أعماله، ويحتوي على أكثر من 4000 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'حجة الله البالغة'، كتب الإمام شاه ولي الله العديد من الكتب الأخرى مثل 'الفوز الكبير في أصول التفسير' و'الإنصاف في بيان أسباب الاختلاف'. كان شاه ولي الله يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 1176 هـ في دلهي ودفن هناك. يُعتبر الإمام شاه ولي الله رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Imam Shah Waliullah al-Dihlawi is one of the greatest hadith scholars in Islam. He was born in Delhi (in present-day India) in 1114 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Hujjat Allah al-Baligha', which is considered one of the most important books in hadith. He passed away in 1176 AH. Imam Shah Waliullah grew up in a scholarly environment as his father was a well-known scholar in Delhi. After his father's death, his mother took care of his upbringing and ensured his education. Shah Waliullah memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Shah Waliullah had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Hujjat Allah al-Baligha' is his most famous work, containing over 4000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Hujjat Allah al-Baligha', Imam Shah Waliullah wrote many other books such as 'Al-Fawz al-Kabir fi Usul al-Tafsir' and 'Al-Insaf fi Bayan Asbab al-Ikhtilaf'. Shah Waliullah was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 1176 AH in Delhi and was buried there. Imam Shah Waliullah is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    },
    {
        "id": 17,
        "nameAr": "مشكات المصابيح",
        "nameEn": "Mishkat Al-Masabih",
        "birthDateHijri": "710",
        "deathDateHijri": "741",
        "descriptionAr": "مشكاة المصابيح هو كتاب جمعه الإمام ولي الدين محمد بن عبد الله الخطيب التبريزي. وُلد الإمام التبريزي في تبريز (في إيران الحالية) في عام 710 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'مشكاة المصابيح'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 741 هـ. الإمام التبريزي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في تبريز. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ التبريزي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان التبريزي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'مشكاة المصابيح' هو أشهر أعماله، ويحتوي على أكثر من 6000 حديث. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'مشكاة المصابيح'، كتب الإمام التبريزي العديد من الكتب الأخرى مثل 'الجامع الكبير' و'الجامع الصغير'. كان التبريزي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 741 هـ في تبريز ودفن هناك. يُعتبر الإمام التبريزي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.",
        "descriptionEn": "Mishkat al-Masabih is a book compiled by Imam Wali al-Din Muhammad ibn Abdullah al-Khatib al-Tabrizi. He was born in Tabriz (in present-day Iran) in 710 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Mishkat al-Masabih', which is considered one of the most important books in hadith. He passed away in 741 AH. Imam al-Tabrizi grew up in a scholarly environment as his father was a well-known scholar in Tabriz. After his father's death, his mother took care of his upbringing and ensured his education. Al-Tabrizi memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Tabrizi had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Mishkat al-Masabih' is his most famous work, containing over 6000 hadiths. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Mishkat al-Masabih', Imam al-Tabrizi wrote many other books such as 'Al-Jami' al-Kabir' and 'Al-Jami' al-Saghir'. Al-Tabrizi was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 741 AH in Tabriz and was buried there. Imam al-Tabrizi is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars."
    }
]