Repository: ahmetbasmaci/hadith_books
Catalog: lib/config/local/intl_*.arb
Languages: ar

# ibnmajahDescription
source: Imam Muhammad ibn Yazid Ibn Majah is one of the greatest hadith scholars in Islam. He was born in Qazvin (in present-day Iran) in 209 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sunan Ibn Majah', which is considered one of the six authentic books of hadith. He passed away in 273 AH. Imam Ibn Majah grew up in a scholarly environment as his father was a well-known scholar in Qazvin. After his father's death, his mother took care of his upbringing and ensured his education. Ibn Majah memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Ibn Majah had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sunan Ibn Majah' is his most famous work, containing over 4000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sunan Ibn Majah', Imam Ibn Majah wrote many other books such as 'Tafsir' and 'Tarikh'. Ibn Majah was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 273 AH in Qazvin and was buried there. Imam Ibn Majah is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: الإمام محمد بن يزيد ابن ماجه هو أحد أعظم علماء الحديث في الإسلام. وُلد في قزوين (في إيران الحالية) في عام 209 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'سنن ابن ماجه'، الذي يُعتبر أحد الكتب الستة الصحيحة في الحديث. توفي في عام 273 هـ. الإمام ابن ماجه نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في قزوين. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ ابن ماجه في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان ابن ماجه يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'سنن ابن ماجه' هو أشهر أعماله، ويحتوي على أكثر من 4000 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'سنن ابن ماجه'، كتب الإمام ابن ماجه العديد من الكتب الأخرى مثل 'التفسير' و'التاريخ'. كان ابن ماجه يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 273 هـ في قزوين ودفن هناك. يُعتبر الإمام ابن ماجه رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.

# malikName
source: Imam Malik ibn Anas
ar: الإمام مالك بن أنس

# malikDescription
source: Imam Malik ibn Anas is one of the greatest scholars of jurisprudence and hadith in Islam. He was born in Medina in 93 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Al-Muwatta', which is considered one of the most important books in jurisprudence and hadith. He passed away in 179 AH. Imam Malik grew up in a scholarly environment as his father was a well-known scholar in Medina. After his father's death, his mother took care of his upbringing and ensured his education. Malik memorized the Quran at a young age and then moved on to study hadith and jurisprudence. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Malik had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Al-Muwatta' is his most famous work, containing over 1700 hadiths, with around 600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and jurisprudence and is studied worldwide. In addition to 'Al-Muwatta', Imam Malik wrote many other books such as 'Al-Risala' and 'Al-Mudawwana'. Malik was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 179 AH in Medina and was buried there. Imam Malik is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest scholars of jurisprudence and hadith.
ar: الإمام مالك بن أنس هو أحد أعظم علماء الفقه والحديث في الإسلام. وُلد في المدينة المنورة في عام 93 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'الموطأ'، الذي يُعتبر أحد أهم الكتب في الفقه والحديث. توفي في عام 179 هـ. الإمام مالك نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في المدينة المنورة. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ مالك في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث والفقه. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان مالك يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'الموطأ' هو أشهر أعماله، ويحتوي على أكثر من 1700 حديث، منها حوالي 600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث والفقه ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'الموطأ'، كتب الإمام مالك العديد من الكتب الأخرى مثل 'الرسالة' و'المدونة'. كان مالك يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 179 هـ في المدينة المنورة ودفن هناك. يُعتبر الإمام مالك رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الفقه والحديث.

# ahmedName
source: Imam Ahmad ibn Hanbal
ar: الإمام أحمد بن حنبل

# ahmedDescription
source: Imam Ahmad ibn Hanbal is one of the greatest scholars of jurisprudence and hadith in Islam. He was born in Baghdad in 164 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Musnad Ahmad', which is considered one of the most important books in jurisprudence and hadith. He passed away in 241 AH. Imam Ahmad grew up in a scholarly environment as his father was a well-known scholar in Baghdad. After his father's death, his mother took care of his upbringing and ensured his education. Ahmad memorized the Quran at a young age and then moved on to study hadith and jurisprudence. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Ahmad had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Musnad Ahmad' is his most famous work, containing over 30,000 hadiths, with around 10,000 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and jurisprudence and is studied worldwide. In addition to 'Musnad Ahmad', Imam Ahmad wrote many other books such as 'Al-Zuhd' and 'Al-Ilal wa Ma'rifat al-Rijal'. Ahmad was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 241 AH in Baghdad and was buried there. Imam Ahmad is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest scholars of jurisprudence and hadith.
ar: الإمام أحمد بن حنبل هو أحد أعظم علماء الفقه والحديث في الإسلام. وُلد في بغداد في عام 164 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'مسند أحمد'، الذي يُعتبر أحد أهم الكتب في الفقه والحديث. توفي في عام 241 هـ. الإمام أحمد نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في بغداد. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ أحمد في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث والفقه. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان أحمد يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'مسند أحمد' هو أشهر أعماله، ويحتوي على أكثر من 30,000 حديث، منها حوالي 10,000 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث والفقه ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'مسند أحمد'، كتب الإمام أحمد العديد من الكتب الأخرى مثل 'الزهد' و'العلل ومعرفة الرجال'. كان أحمد يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 241 هـ في بغداد ودفن هناك. يُعتبر الإمام أحمد رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الفقه والحديث.

# alnawawiName
source: Imam Yahya ibn Sharaf al-Nawawi
ar: الإمام يحيى بن شرف النووي

# alnawawiDescription
source: The Forty Hadith of Imam al-Nawawi is a collection of hadiths compiled by Imam Yahya ibn Sharaf al-Nawawi. He was born in Nawa (in present-day Syria) in 631 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Al-Arba'in al-Nawawiyya', which is considered one of the most important books in hadith. He passed away in 676 AH. Imam al-Nawawi grew up in a scholarly environment as his father was a well-known scholar in Nawa. After his father's death, his mother took care of his upbringing and ensured his education. Al-Nawawi memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Nawawi had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Al-Arba'in al-Nawawiyya' is his most famous work, containing 42 hadiths. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Al-Arba'in al-Nawawiyya', Imam al-Nawawi wrote many other books such as 'Riyad al-Salihin' and 'Sharh Sahih Muslim'. Al-Nawawi was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 676 AH in Nawa and was buried there. Imam al-Nawawi is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: النَّوَوِي (٦٣١ - ٦٧٦ هـ = ١٢٣٣ - ١٢٧٧ م) علامة بالفقه والحديث. مولده ووفاته في نوا (من قرى حوران، بسورية) وإليها نسبته. تعلم في دمشق، وأقام بها زمنا طويلا. (من كتبه) • تهذيب الأسماء واللغات - ط • منهاج الطالبين - ط • الدقائق - ط • تصحيح التنبيه - ط في فقه الشافعية رأيت مخطوطة قديمة منه باسم التنبيه على ما في التنبيه • المنهاج في شرح صحيح مسلم - ط خمس مجلدات • التقريب والتيسير - ط في مصطلح الحديث • حلية الأبرار - ط يعرف بالأذكار النووية • خلاصة الأحكام من مهمات السنن وقواعد الإسلام - خ [طُبع] • ورياض الصالحين من كلام سيد المرسلين - ط • بستان العارفين - ط • الإيضاح - ط في المناسك • شرح المهذب للشيرازي - ط • روضة الطالبين - خ فقه [طُبع] • والتبيان في آداب حملة القرآن - ط • المقاصد - ط رسالة في التوحيد • مختصر طبقات الشافعية لابن الصلاح - خ • مناقب الشافعيّ - خ • المنثورات - ط فقه، وهو كتاب فتاويه • مختصر التبيان - خ مواعظ، والأصل له • منار الهدى - ط في الوقف والابتداء، تجويد • الإشارات إلى بيان أسماء المبهمات - ط رسالة • الأربعون حديثا النووية - ط شرحها كثيرون. • وأفردت ترجمته في رسائل، إحداها للسحيمي، والثانية للسخاوي، والثالثة «المنهاج السوي» للسيوطي مخطوطتان، والثالثة للسخاوي مطبوعة (أفادنا بها عبيد) • وفي طبقات ابن قاضي شهبة: قال الإسنوي: وينسب إليه تصنيفان ليسا له، أحداهما مختصر لطيف يسمى «النهاية في اختصار الغاية - خ» في الظاهرية، والثاني «أغاليط على الوسيط» مشتملة على خمسين موضعا فقهية وبعضها حديثية، وممن نسب إليه هذا «ابن الرفعة» في شرح الوسيط، فاحذره، فإنه لبعض الحمويين، ولهذا لم يذكره ابن العطار تلميذه حين عدد تصانيفه واستوعبها. • وأورد ابن مرعي، في «الفتوحات الوهبية» نسبه كاملا، وقال: مرّي، بضم الميم وكسر الراء، كما وجد مضبوطا بخطه، والحزامي: بكسر الحاء المهملة، وبالزاي المعجمة، والنووي: نسبة لنوا، يجوز كتبها بالألف: «نواوي» قلت: كان يكتبها هو بغير الألف، انظر نموذج خطه (١). _________ (١) طبقات الشافعية للسبكي ٥: ١٦٥ وطبقات الشافعية لابن قاضي شهبة - خ. والنعيمي ١: ٢٤ وفيه: وفاته سنة ٦٧٧ والنجوم الزاهرة ٧: ٢٧٨ و Brock ١: ٤٦٩ (٣٩٤) S ١: ٦٨٠ وآداب اللغة ٣: ٢٤٢ والتبيان - خ. ومفتاح السعادة ١: ٣٩٨ والتيمورية ٣: ٣٠٧ وهادي المسترشدين ٤٧١ و ٢٤٨ Huart وابن الفرات ٧: ١٠٨ والآصفية ١: ٥٢١ و ٢: ١٣٨، ٢٣٠ و Bankipore ١٣: ٨٠ والفتوحات الوهبية لإبراهيم بن مرعي الشبرخيتي. نقلا عن: «الأعلام» للزركلي [مع إضافات بين معقوفين]

# darimiName
source: Imam Abu Muhammad Abd al-Rahman ibn Abd Allah ibn al-Darimi
ar: الإمام أبو محمد عبد الرحمن بن عبد الله بن الدارمي

# darimiDescription
source: Imam Abdullah ibn Abdul Rahman al-Darimi is one of the greatest hadith scholars in Islam. He was born in Samarkand (in present-day Uzbekistan) in 181 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sunan al-Darimi', which is considered one of the six authentic books of hadith. He passed away in 255 AH. Imam al-Darimi grew up in a scholarly environment as his father was a well-known scholar in Samarkand. After his father's death, his mother took care of his upbringing and ensured his education. Al-Darimi memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Darimi had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sunan al-Darimi' is his most famous work, containing over 3500 hadiths, with around 1500 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sunan al-Darimi', Imam al-Darimi wrote many other books such as 'Al-Musnad' and 'Al-Tarikh'. Al-Darimi was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 255 AH in Samarkand and was buried there. Imam al-Darimi is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: الإمام عبد الله بن عبد الرحمن الدارمي هو أحد أعظم علماء الحديث في الإسلام. وُلد في سمرقند (في أوزبكستان الحالية) في عام 181 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'سنن الدارمي'، الذي يُعتبر أحد الكتب الستة الصحيحة في الحديث. توفي في عام 255 هـ. الإمام الدارمي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في سمرقند. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ الدارمي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان الدارمي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'سنن الدارمي' هو أشهر أعماله، ويحتوي على أكثر من 3500 حديث، منها حوالي 1500 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'سنن الدارمي'، كتب الإمام الدارمي العديد من الكتب الأخرى مثل 'المسند' و'التاريخ'. كان الدارمي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 255 هـ في سمرقند ودفن هناك. يُعتبر الإمام الدارمي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.

# shahwaliullah40Name
source: Shah Waliullah Dahlawi
ar: الشاه ولي الدين الدهلوي

# shahwaliullah40Description
source: Imam Shah Waliullah al-Dihlawi is one of the greatest hadith scholars in Islam. He was born in Delhi (in present-day India) in 1114 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Hujjat Allah al-Baligha', which is considered one of the most important books in hadith. He passed away in 1176 AH. Imam Shah Waliullah grew up in a scholarly environment as his father was a well-known scholar in Delhi. After his father's death, his mother took care of his upbringing and ensured his education. Shah Waliullah memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Shah Waliullah had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Hujjat Allah al-Baligha' is his most famous work, containing over 4000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Hujjat Allah al-Baligha', Imam Shah Waliullah wrote many other books such as 'Al-Fawz al-Kabir fi Usul al-Tafsir' and 'Al-Insaf fi Bayan Asbab al-Ikhtilaf'. Shah Waliullah was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 1176 AH in Delhi and was buried there. Imam Shah Waliullah is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: الإمام شاه ولي الله الدهلوي هو أحد أعظم علماء الحديث في الإسلام. وُلد في دلهي (في الهند الحالية) في عام 1114 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'حجة الله البالغة'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 1176 هـ. الإمام شاه ولي الله نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في دلهي. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ شاه ولي الله في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان شاه ولي الله يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'حجة الله البالغة' هو أشهر أعماله، ويحتوي على أكثر من 4000 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'حجة الله البالغة'، كتب الإمام شاه ولي الله العديد من الكتب الأخرى مثل 'الفوز الكبير في أصول التفسير' و'الإنصاف في بيان أسباب الاختلاف'. كان شاه ولي الله يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 1176 هـ في دلهي ودفن هناك. يُعتبر الإمام شاه ولي الله رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.

# tabriziName
source: Al-Khatib Al-Tabrizi
ar: الإمام الكاتب التبريزي

# tabriziDescription
source: Mishkat al-Masabih is a book compiled by Imam Wali al-Din Muhammad ibn Abdullah al-Khatib al-Tabrizi. He was born in Tabriz (in present-day Iran) in 710 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Mishkat al-Masabih', which is considered one of the most important books in hadith. He passed away in 741 AH. Imam al-Tabrizi grew up in a scholarly environment as his father was a well-known scholar in Tabriz. After his father's death, his mother took care of his upbringing and ensured his education. Al-Tabrizi memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Tabrizi had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Mishkat al-Masabih' is his most famous work, containing over 6000 hadiths. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Mishkat al-Masabih', Imam al-Tabrizi wrote many other books such as 'Al-Jami' al-Kabir' and 'Al-Jami' al-Saghir'. Al-Tabrizi was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 741 AH in Tabriz and was buried there. Imam al-Tabrizi is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: مشكاة المصابيح هو كتاب جمعه الإمام ولي الدين محمد بن عبد الله الخطيب التبريزي. وُلد الإمام التبريزي في تبريز (في إيران الحالية) في عام 710 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'مشكاة المصابيح'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 741 هـ. الإمام التبريزي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في تبريز. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ التبريزي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان التبريزي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'مشكاة المصابيح' هو أشهر أعماله، ويحتوي على أكثر من 6000 حديث. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'مشكاة المصابيح'، كتب الإمام التبريزي العديد من الكتب الأخرى مثل 'الجامع الكبير' و'الجامع الصغير'. كان التبريزي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 741 هـ في تبريز ودفن هناك. يُعتبر الإمام التبريزي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.

# ibnhijrName
source: Ibn Hajar al-Asqalani
ar: الإمام ابن حجر العسقلاني
