Repository: ahmetbasmaci/hadith_books
Catalog: lib/config/local/intl_*.arb
Languages: ar

# ibnhijrDescription
source: Imam Ahmad ibn Ali ibn Hajar al-Asqalani. He was born in Ascalon (in present-day Palestine) in 773 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Bulugh al-Maram', which is considered one of the most important books in hadith. He passed away in 852 AH. Imam Ibn Hajar grew up in a scholarly environment as his father was a well-known scholar in Ascalon. After his father's death, his mother took care of his upbringing and ensured his education. Ibn Hajar memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Ibn Hajar had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Bulugh al-Maram' is his most famous work, containing over 1500 hadiths. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Bulugh al-Maram', Imam Ibn Hajar wrote many other books such as 'Fath al-Bari' and 'Al-Isabah fi Tamyiz al-Sahabah'. Ibn Hajar was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 852 AH in Cairo and was buried there. Imam Ibn Hajar is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: الإمام أحمد بن علي بن حجر العسقلاني. وُلد الإمام ابن حجر في عسقلان (في فلسطين الحالية) في عام 773 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'بلوغ المرام'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 852 هـ. الإمام ابن حجر نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في عسقلان. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ ابن حجر في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان ابن حجر يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'بلوغ المرام' هو أشهر أعماله، ويحتوي على أكثر من 1500 حديث. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'بلوغ المرام'، كتب الإمام ابن حجر العديد من الكتب الأخرى مثل 'فتح الباري' و'الإصابة في تمييز الصحابة'. كان ابن حجر يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 852 هـ في القاهرة ودفن هناك. يُعتبر الإمام ابن حجر رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.

# aliBinNayifName
source: Ali Bin Nayif
ar: علي بن نايف

# aliBinNayifDescription
source: The Forty Qudsi Hadiths is a collection of sacred hadiths compiled by Muslim scholars. Qudsi hadiths are those hadiths narrated by the Prophet Muhammad (peace be upon him) from Allah Almighty. These hadiths differ from prophetic hadiths in that they are attributed directly to Allah. The Forty Qudsi Hadiths contains 40 sacred hadiths and is considered a fundamental reference in the science of hadith and is studied worldwide. These hadiths cover various topics such as monotheism, worship, and ethics. This book is considered a fundamental reference in the science of hadith and is studied worldwide.
ar: الأربعون القدسية هي مجموعة من الأحاديث القدسية التي جمعها العلماء المسلمون. الأحاديث القدسية هي تلك الأحاديث التي يرويها النبي محمد صلى الله عليه وسلم عن الله تعالى. هذه الأحاديث تختلف عن الأحاديث النبوية في أنها تنسب إلى الله مباشرة. الأربعون القدسية تحتوي على 40 حديثاً قدسياً، وهي تُعتبر مرجعاً أساسياً في علم الحديث وتُدرس في جميع أنحاء العالم الإسلامي. هذه الأحاديث تتناول مواضيع متنوعة مثل التوحيد، العبادة، والأخلاق. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي.

# bukhariBookName
source: Sahih al-Bukhari
ar: صحيح البخاري

# muslimBookName
source: Sahih Muslim
ar: صحيح مسلم

# abudawudBookName
source: Sunan Abi Dawood
ar: سنن أبي داود

# tirmidhiBookName
source: Jami' at-Tirmidhi
ar: جامع الترمذي

# nasaiBookName
source: Sunan an-Nasa'i
ar: سنن النسائي

# ibnmajahBookName
source: Sunan Ibn Majah
ar: سنن ابن ماجه

# malikBookName
source: Muwatta Imam Malik
ar: موطأ الإمام مالك

# ahmedBookName
source: Musnad Ahmad
ar: مسند الإمام أحمد

# riyadAssalihinBookName
source: Riyad as-Salihin
ar: رياض الصالحين

# nawawi40BookName
source: Al-Nawawi's Forty Hadith
ar: الأربعين النووية

# shamailMuhammadiyahBookName
source: Shama'il Muhammadiyyah
ar: الشمائل المحمدية

# bulughAlmaramBookName
source: Bulugh al-Maram
ar: بلوغ المرام

# aladabAlmufradBookName
source: Al-Adab al-Mufrad
ar: الأدب المفرد

# darimiBookName
source: Sunan al-Darimi
ar: سنن الدارمي

# qudsi40BookName
source: Al-Qudsi's Forty Hadith
ar: الأربعين القدسية

# shahwaliullah40BookName
source: Shah Waliullah's Forty Hadith
ar: الأربعين الولي الله

# mishkatAlmasabihBookName
source: Mishkat al-Masabih
ar: مشكات المصابيح

# muslimBookDescription
source: will add soon..
ar: اسم الكتاب: لم يأتِ في جُلِّ نسخ (صحيح مسلم) تصريحٌ باسمه الحقيقي الذي وضعه له مؤلفه، ولا حتى في ما وصل إلينا من الشروح عليه كشرح المازري، والقاضي عياض، والنووي، والأُبِيِّ، ... وغيرهم، وإنما جاءَ وَصفُهُ بـ (الصحيح) في أغلبِ ذلك، وكذا في جُلِّ طبعات الكتاب القديمة منها والحديثة. وقد أشار الإمام مسلم رحمه الله إلى بعضٍ من عنوان كتابه في قوله: « صنفت هذا (المسند الصحيح) من ثلاثمائة ألف حديث مسموعة »، فسماه (المسند الصحيح)، وهو اختصار منه رحمه الله لاسمه الكامل والطويل. وقد حقق الشيخ عبد الفتاح أبو غدة في رسالته (تحقيق اسمي الصحيحين) أن اسم صحيح مسلم الكامل هو: (المسند الصحيح المختصر من السنن بنقل العدل عن العدل عن رسول الله صلى الله عليه وسلم )، وساق في إثبات ذلك نصوصا مسندة عن صاحب الكتاب. سبب تأليفه: أبان الإمام مسلم عن دافعه من تصنيف كتابه (الصحيح) في مقدمته فقال رحمه الله: « فإنك -يرحمك الله- بتوفيق خالِقِك ذكرت أنك هممت بالفحص عن تَعَّرُفِ جملةالأخبار المأثورة عن رسول الله صلى الله عليه وسلم في سنن الدين وأحكامِهِ،وما كان منها في الثواب والعقاب، والترغيب والترهيب، وغير ذلك من صنوفالأشياء، بالأسانيد التي بها نُقِلَت، وتدَاولَها أهل العلم فيما بينهم ... وللذي سَأَلتَ - أكرمك الله - حين رجعتُ إلى تدبرِه، وما تؤول به الحالـ إن شاء الله ـ عاقبةٌ محمودةٌ، ومنفعةٌ موجودةٌ، وظننتُ حين سألتني تجشُّمَ ذلكأن لو عُزِم لي عليه، وقُضِي لي تمامُه؛ كان أول من يصيبُهُ نفعُ ذلك إياي خاصةقبل غيري من الناس ... ولكن من أجل ما أعلمناك من نشر القومالأخبار المنكرة بالأسانيد الضعاف المجهولة، وقذفهم بها إلى العوام الذينلا يعرفون عيوبها؛ خفَّ على قلوبنا إجابتك إلى ما سألت». فظهر من كلام الإمام مسلم في مقدمته أن سبب تصنيفه لِكتابِه هو استجابة لمن طَلَب منه وضع كتاب يحوي أحاديث بأسانيد متداولةٍ عند أهل العلم في الأحكام والترغيب والترهيب، إضافة إلى انتشار الأخبار المنكرة الضعيفة بين عوام الناس؛ فنشط رحمه الله من أجل ذلك لتصنيف كتابه (الصحيح). الرواة عن الإمام مسلم: كان للإمام مسلم العشرات من التلاميذ، أَحصى منهم الإمام الذهبي أكثر من خمسة وثلاثين، أما من سَمِعَ منه صحيحَه بالكامل، ثم رواه للناس؛ فقَدَ ذكر الضياء المقدسي في (جزء الرواة عن مسلم) منهم عشرة رواة، والكتاب « مع شهرته التامة، صارتروايته بإسناد متصل بمسلم مقصورة على أبي إسحاق إبراهيم بن محمد بن سفيان، غيرأنَّه يُروى في بلاد المغرب مع ذلك عن أبي محمد أحمد بن علي القلانسي ». قال الإمام النووي: « صحيح مسلم رحمه الله في نهايةٍ من الشهرة، وهو متواترٌ عنه من حيث الجملة، فالعلم القطعي حاصلٌ بأنَّه من تصنيف أبي الحسين مسلم بن الحجَّاج، وأما من حيث الروايةُ المتصلةُ بالإسناد المتصل بمسلم؛ فقد انحصرت طريقه عنه في هذه البلدان والأزمان في رواية أبي إسحاق إبراهيم بن محمد بن سفيان، عن مسلم، ويروى في بلاد المغرب مع ذلك عن أبي محمد أحمد بن علي القلانسي عن مسلم ». إذن فلصحيح مسلم روايتان متصلتا الإسناد إلى صاحب الكتاب: الأولى: رواية المشارقة، وهي رواية إبراهيم بن محمد بن سفيان. الثانية: رواية المغاربة، وهي رواية القلانسي. عنايته بتأليفه: يظهر مدى العناية التي أولاها الإمام مسلم صحيحه من خلال ما يلي: أولا: المدة الطويلة التي استغرقها تصنيف الكتاب، قال أحمد من سلمة - وهو من تلاميذ مسلم - : « كتبت مع مسلم رحمه الله في صحيحه خمس عشرةَ سنة، وهو اثنا عشر ألف حديث ». ثانيا: انتقاؤه لأحاديثه من ألوفِ الروايات، حيث قال رحمه الله: « صنَّفْتُ هذا المسند الصحيح من ثلاثمائة ألف حديث مسموعة ». ثالثا: عَرْضُه لكتابه على جهابذة النقاد من شيوخه، حيث قال مصرحا بذلك: « عَرضْتُ كتابي هذا على أبي زرعة الرازي فكل ما أشار أنَّ له علةً تركتُهُ، وكل ما قال: إنه صحيح، وليس له علة خرَّجته ». رابعا: تَثَبُّتُه في إخراج أحاديثِ كتابِه، وتَحَرُّزُه من إخراج ما لم تتوافر فيه شروط الصحة، ويظهر حرصه هذا من خلال قوله رحمه الله في مقدمة صحيحه: « واعلم - وفقك الله تعالى - أن الواجب على كل أحدٍ عَرَفَ التَّمْييزَ بين صحِيحِ الروايات وسقيمِها، وثقاتِ الناقلين لها من المتَّهمين؛ أن لا يروِيَ منها إلا ما عُرِفَ صحةُ مخارجه، والستارةُ في ناقِلِيه، وأن يُنَقِّيَ منها ما كان منها عن أهل التُّهَمِ والمعانِدين من أهل البدع ». وقوله أيضا: « ما وضعت في كتابي هذا المسند إلا بحجة، وما أسقطت منه شيئا إلا بحجة». أبواب الكتاب: لم يترجم الإمام مسلم رحمه الله لأبواب كتابه (الصحيح)، أي أنه لم يجعل لأبواب الكتاب عناوين محددة، لكنه رحمه الله كان في ترتيبه للكتاب يجمع الأحاديث ذات الموضوع الواحد فيجعلها متسلسلة تسلسلا فقهيا كما أشار إلى ذلك ابن القيم حيث قال: « قول مسلم بن الحجاج يُعْرَف قولُهُ في السنة من سياق الأحاديث التي ذكرها ولم يتأولها، ولم يذكُرْ لها التراجم كما فعل البخاري، ولكن سَرَدَها بلا أبواب، ولكن تُعْرَفُ التراجمُ من ذكره للشيءِ مع نظيره ». قال ابن الصلاح: « ثم إن مسلما - رحمه الله وإيانا - رتَّب كتابه على الأبواب، فهو مُبوبٌ في الحقيقة، ولكنه لم يذكر فيه تراجم الأبواب لئلا يزداد حجم الكتاب، أو لغير ذلك ». والأبواب الموجودة في الصحيح هي من صناعة بعض المتأخرين كأبي نعيم صاحب (المستخرج)، والنووي في شرحه - وهي الأشهر-، وكذا القرطبي في شرحه أيضا. قال النووي رحمه الله: « وقد ترجم جماعة أبوابه بتراجم بعضها جيِّد،وبعضها ليس بجيِّد، إما لقصور في عبارة الترجمة، وإما لركاكة لفظها، وإمالغير ذلك، وأنا - إن شاء الله - أحرص على التعبير عنها بعبارات تليق بها فيمواطنها ». ولعلَّ هذا ما يفسر خُلُوَّ الطبعات القديمة من التراجم، وهو نفس الأمر بالنسبة لبعض الطبعات التي عليها شرح الأُبِّي والسنوسي، لا نجد فيها سوى الأحاديث مسرودة. عدد أحاديث صحيح مسلم: تقدم قول أحمد بن سلمة - تلميذ الإمام مسلم رحمه الله - عن كتاب شيخه بأن عدة أحاديثه: «اثنا عشر ألف حديث ». قال الإمام الذهبي معقبا على كلام ابن سلمة: « عُنِيَ بالمكرر بحيث إنه إذا قال: حدثنا قتيبة، وأخبرنا ابن رمح، يُعَدَّان حديثين اتفق لفظهما أو اختلف في كلمة ». وعدد ما في (الصحيح) بإسقاط المكرر أربعة آلاف حديث كما قال النووي. وحسب ترقيم محمد فؤاد عبد الباقي فعدة ما في (صحيح مسلم) بإسقاط المكرر 3033 حديثا، ومسلم يكرر ذكر بعض الأحاديث في مواضع من كتابه، قال محمد فؤاد عبد الباقي رحمه الله: « كرر مسلم في صحيحه 137 حديثا في مواضع متعددة منها 71 حديثا يضع الحديث منها في كتاب غير الكتاب الذي وضع الحديث فيه لأول مرة ». المعلقات في صحيح مسلم: لم تبلغ معلقات (صحيح مسلم) في كثرتها ما هو موجود في صحيح البخاري رحمه الله، وقد اختلف العلماء في عدِّها، وأكبر ما نُصَّ عَلَيْهِ من عدد المعُلَّقات: أربعةَ عشرَ حديثا، قال بذلك: أبو علي الجياني، والإمام المازري، والحافظ العراقي، وهذا العدد لا يشكل إلا نسبة ضئيلة جدا من مجموع عدد أحاديث (صحيح مسلم)، وذهب فريقٌ إلى أن عدَّة المعلقات: اثنا عشر حديثا، وبعضهم قال: إنها أقل من ذلك، وسبب اختلافهم هو كون أحد هذه الأحاديث - الأربع عشرة - مكَرَّرٌ، أو أن بعضها جاء موصولا في نفس الكتاب في مواضع أخرى فلم يكن معلقًا في واقع الأمر. قال الحافظ العراقي: « وفيه بقية أربعة عشر موضعا رواه متصلا، ثم عقبه بقوله: رواه فلان. وقد جمعها الرشيد العطار في الغرر المجموعة، وقد بينت ذلك كله في جزء مفرد » قال ابن حجر معقبا: « ليس فيه عند الرشيد إلا ثلاثة عشر، والذي أوقع الشيخ في ذلك أن أبا عليًّا الجياني - وتبعه المازري - ذكر أنها أربعة عشر، لكن لما سردها أورد منها حديثا مكررا ... فصارت العدة ثلاثة عشر ». شرط مسلم في صحيحه: تقدَّم بيان شرط الإمام مسلم رحمه الله سابقا أثناء الكلام عن شرط الإمام البخاري، كما سَبَقَ بيان أن المراد بـ"الشرط" هنا غير ما هو معروف من الخلاف بينهما في السند المعنعَن. قال أبو عمرو بن الصلاح: « شرط مسلم في صحيحه: أن يكون الحديث متصل الإسناد، بنقل الثقة عن الثقة من أوله إلى منتهاه، سالما من الشذوذ، ومن العلة، وهذا هو حَدُّ الحديث الصحيح في نفس الأمر، فكل حديث اجتمعت فيه هذه الأوصاف فلا خلاف بين أهل الحديث في صحته ». وتقدم قول ابن طاهر المقدسي: « « اعلم أن شرط البخاري ومسلم أن يخرجا الحديث المتفق على ثقة نقلته إلى الصحابي المشهور، من غير اختلاف بين الثقات الأثبات، وأن يكون إسناده متصلا غير مقطوع، فإن كان للصحابي راويان فصاعدا فحسنٌ، وإن لم يكن له إلا راوٍ واحد إذا صح الطريق إلى ذلك الراوي أخرجاه ». فبهذا الاعتبار في شرطهما في وثاقة الراوي واحد، إلا أن مسلمًا ارتضى من الرواة بعض من لم يرتضه البخاري والعكس، ولذلك قال ابن طاهر بعد كلامه السابق: « إلا أن مسلما أخرج أحاديث أقوام ترك البخاري حديثهم، لشبهة وقعت في نفسه، أخرج مسلم أحاديثهم بإزالة الشبهة ». قال شيخ الإسلام ابن تيمية: « وأما شرط البخاري ومسلم، فلهذا رجال يروي عنهم يختص بهم، ولهذا رجال يروى عنهم يختص بهم، وهما مشتركان في رجال آخرين، وهؤلاء الذين اتفقا عليهم؛ عليهم مدار الحديث المتفق عليه، وقد يروى أحدهم عن رجل في المتابعات، والشواهد دون الأصل، وقد يروي عنه ما عرف من طريق غيره، ولا يروى ما انفرد به، وقد يترك من حديث الثقة ما علم أنه أخطأ فيه؛ فيظن من لا خبرة له إن كل ما رواه ذلك الشخص يحتج به أصحاب الصحيح وليس الأمر كذلك ». شرطه في السند المعنعن: تقدمت الإشارة إلى شرط الإمام مسلم في السند المعنعَن عند الحديث عن شرط البخاري في ذلك، وتَمَّ بيان أن مسلمًا رحمه الله لم يشترط أكثر من المعاصرة وإمكانية اللقاء بين المُعنعِِن والمعنعَن عنه، شرط أن لا يكون الأول مدلسًا، وقد أفصح مسلمٌ عن شرطه ذاك في مقدمة صحيحه، بل نافَحَ عنه ورد بقوة، وشَنَّع على من اشترط ثبوت اللقاء والسماع فقال رحمه الله: « وقد تكلم بعض منتحلي الحديث من أهل عصرنا في تصحيح الأسانيد وتسقيمها؛ بقول لو ضربْنَا عن حكايتِهِ وذكر فسادِه صفحًا؛ لكان رأيًا متينًا، ومذهبًا صحيحًا؛ إذ الإعراض عن القول المطَّرِحِ أحرى لإماتته، وإخمال ذكر قائله، وأجدر أن لا يكون ذلك تنبيهًا للجُهَّال عليه، غير أنَّا لما تخوَّفنا من شرور العواقب، واغترار الجهلة بمحدثات الأمور، وإسراعهم إلى اعتقاد خطأ المخطئين، والأقوال الساقطة عند العلماء؛ رأينا الكشف عن فساد قوله ». وقد اختلف العلماء في تحديد المقصود بكلام مسلم هنا: أهو شيخه البخاري، أو ابن المديني، أو غيرهما ؟ وليس هذا مجال بسط ذلك بالتفصيل. ثم عرض مسلم رأي مخالفيه في اشتراط اللقاء، ثم قال: « وهذا القول [ يعني كلام خصمه ] -يرحمك الله - في الطعن في الأسانيد؛ قولٌ مخترعٌ، مستحدثٌ غير مسبوقٍ إليه، ولا مساعدَ له من أهل العلم عليه، وذلك أن القول الشائع المتفق عليه بين أهل العلم بالأخبار والروايات قديمًا وحديثًا: أن كل رجل ثقة روى عن مثله حديثًا، وجائزٌ ممكنٌ له لقاؤُهُ، والسماعُ منه، لكونهما جميعًا كانا في عصر واحد، وإن لم يأتِ في خبر قط أنهما اجتمعا، ولا تشافها بكلام؛ فالرواية ثابتة، والحجة بها لازمة، إلا أن يكون هناك دلالة بينة أن هذا الراوي لم يلق من روى عنه، أو لم يسمع منه شيئًا. فأما والأمر مبهَمٌ على الإمكان الذي فسَّرْنا؛ فالرواية على السماع أبدًا، حتى تكون الدلالة التي بَيَّنَّا ». لكن جمهور أهل العلم على تصحيح مذهب البخاري وترجيحه على مذهب تلميذه الإمام مسلم، وقد تقَدَّمَ نقلُ شيءٍ من أقوالِهِم في تقرير ذلك. [التعريف بالكتاب ، نقلاً عن موقع : أهل الحديث]

# abudawudBookDescription
source: will add soon..
ar: كتاب السنن وأهميته ورأي العلماء فيه : وهو أشهر كتب أبي داود وأعظمها دون فيه أربعة ألاف وثمانمائة حديث انتقاها من بين خمسمائة ألف حديث . قال تلميذه أبو بكر بن داسة : سمعت أبا داود يقول : ( كتبت عن رسول الله خمسمائة ألف حديث انتخبت منها كتاب السنن فيه أربعة آلاف وثمانمائة حديث ، ذكرت الصحيح وما يشبهه ويقاربه ، وما كان فيه وهن شديد بينته ). وقد سار أبو داود فيه على طريقة التخصص ، فحدد الجانب الفقهي له فجعل كتابه خاصا بالأحكام والسنن فتميز على غيره من الرواة عدا البخاري . قسم كتابه إلى كتب ، وقسم الكتب إلى أبواب ، ووضع في الأبواب أحاديث يستدل بها الفقهاء ويبنون عليها الأحكام ، وسجل رحمه الله التراجم على الأحاديث ببراعة . قال أبو داود في رسالته لأهل مكة : ( لم أصنف في كتاب السنن إلا الأحكام ولم أصنف كتب الزهد وفضائل الأعمال وغيرها ، فهذه أربعة آلاف وثمانمائة حديث كلها في الأحكام ، وهناك أحاديث كثيرة في الزهد والفضائل وغيرها لم أخرجها ) . كما قال مبينا أهمية كتابه السنن في رسالته ( وهو كتاب لا ترد عليك سنه عن النبي صلى الله عليه وسلم بإسناد صحيح إلا وهي فيه ، إلا أن يكون كلاما استخرج من الحديث ولا يكاد يكون هذا ، ولا أعلم شيئا بعد القران الزم للناس أن يتعلموا من هذا الكتاب ، ولا يضر رجلا ألا يكتب من العلم شيئا بعد ما يكتب هذا الكتاب ، وإذا نظر فيه وتدبره وتفهمه حينئذ يعلم مقداره ). وقد عد الإمام شاه ولي الدين الدهلوي كتاب السنن في الطبقة الثانية من كتب الأحاديث والتي تلي الصحيحين والموطأ . وقد عرف علماء الفقه والحديث لأبي داود وكتابه هذا الفضل فقال الإمام الغزالي رحمه الله ( إن السنن لأبي داود تكفي المجتهد بعد كتاب الله تعالى . وقال ابن الأعرابي أحد رواة السنن ( لو لم يكن عند الرجل إلا المصحف وهذا الكتاب لم يحتج الى شيء من العلم البته ) . ولذلك كان الكتاب محل عناية واهتمام من العلماء من جميع التخصصات فشرح ودرس وأصبح مصدرا من المصادر التي يعتمدون عليها في الفقه والحديث . وقد جاوزت شروحه العشرة واهم هذه الشروحات وأشهرها ( معالم السنن ) للإمام أبي سليمان البستي الخطابي ( توفي 388 هجرية ) . وكذلك اشهر الاختصارات ( المجتبي ) للمنذري ( ت 656 هجرية ) ، وكذلك (تهذيب سنن أبي داود ) لابن قيم الجوزية ( ت751 هجرية ) أكمل الروايات عنه : تعتبر رواية تلميذه أبي بكر محمد بن عبد الرازق بن داسة أكمل الروايات . أما أصح الروايات فهي رواية تلميذه أبي علي محمد بن أحمد بن عمر اللؤلئي . [التعريف بالكتاب ، نقلا عن موقع : أهل الحديث]

# tirmidhiBookDescription
source: will add soon..
ar: اسم الكتاب: لقد أطلقت عدة أسماء على كتاب الترمذي الجامع منها (صحيح الترمذي) والجامع الصحيح والجامع الكبير وجامع الترمذي "وسنن الترمذي" وهو اسم مشهور للكتاب ولكن أشهر هذه الأسماء وأكثرها استعمالا هو جامع الترمذي. منزلة الكتاب وموضوعه: يعد كتاب الإمام الترمذي الجامع أحد أصول الحديث النبوي السنة المشهورة. وقد أثنى عليه العلماء كثيرا لما اشتمل عليه من الفوائد الحديثية والفقهية قال الإمام الترمذي رحمه الله "صنفت هذا الكتاب فعرضته على علماء الحجاز والعراق وخراسان فرضوا به، ومن كان في بيته هذا الكتاب فكأن في بيته نبي يتكلم" وقال الإمام الشوكاني عن خصائص جامع الترمذي "وكتابه الجامع أحسن الكتب وأكثرها فائدة وأحكمها ترتيبا وأقلها تكرارا وفيه ما ليس في غيره من ذكر المذاهب ووجوه الاستدلال والإشارة إلى ما في الباب من الأحاديث، وتبين أنواع الحديث من الصحة والحسن والغرابة والضعف وفيه جرح وتعديل في آخره كتاب العلل قد جمع فيه فوائد حسنة". منهج الكتاب: 1- أنه جمع طريقتي البخاري ومسلم: طريقة البخاري حيث يعني بالفقه، وطريقة مسلم حيث يضع الحديث في موضعه الذي يظن أنه فيه، وحيث يعني بالفوائد الإسنادية فيجمع الروايات المتعددة إن أمكنه ذلك. 2- تميز منهجه بأنه منهج معلل أي أن رواة الحديث يتفاوتون في العدالة والضبط فقد أخذ الترمذي عن رجال الطبقة الرابعة وهم قوم شاركوا أهل الطبقة الثالثة في الجرح والتعديل وليسوا بالمتروكين ولا الكذابين ولا فاحشي الخطأ وبعضهم لا يعتمد عليه لو انفرد في الحديث ولكنهم يصلحون للاحتجاج إذا وجدوا من يؤيدهم ويعضدهم وبذلك يكون الترمذي قد فتح الباب لتدارك ما لم يتداركه غيره فشرطه واسع جدا يجعل كل حديث عمل به فقيه داخلا في شرطه لذلك جمع في كتابه الصحيح والواهي، والمتصل والمنقطع والسالم والمعل. 3- إن الإمام الترمذي هو أول من قسم الحديث من حيث القبول أو الرد إلى ثلاثة أقسام صحيح، حسن، ضعيف. 4- كان الإمام الترمذي يبدأ بالأحاديث الغريبة الإسناد غالبا ثم يعقب بالإسناد القوي الذي هو الأصل في الباب أي كان ينظر إلى الحديث من الأدني إلى الأعلى. 5- ألفه على أبواب الفقه وغيره وأودعه الصحيح والحسن والضعيف ونوع الترمذي طريقة جمع أحاديث الباب في كتابه الجامع إلى مسلكين سلكهما في كل باب من أبواب الكتاب هما: أ- رواية طائفة من الأحاديث بأسانيدها ب- الإشارة إلى أحاديث في معنى ما أخرجه في الباب بأن يذكر روايتها من الصحابة. ومن أهم الأعمال عليه كتاب عارضة الأحوذي في شرح الترمذي لابن العربي المالكي ومختصر الجامع لنجم الدين بن عبد القوي الطوفي والجامع لنجم الدين محمد بن عقيل. شروح الكتاب: 1- تحفة الأحوذي شرح جامع الترمذي. 2- معارف السنن شرح جامع الترمذي. [التعريف بالكتاب ، نقلاً عن موقع : داريا]

# nasaiBookDescription
source: will add soon..
ar: ثناء العلماء على كتابه السنن : من العبارات التي يمكن أن تفيدنا في معرفة مكانة سنن النسائي قول ابن الرشيد : "كتاب النسائي أبدع الكتب المصنفة للسنن تصنيفاً وأحسنها ترصيفاً " . ويقول عبد الرحيم المكي الذي هو أحد شيوخ ابن الأحمر الذي هو أحد رواة السنن ، يقول عن سنن النسائي : " إنه أشرف المصنفات كلها ، وما وضع في الإسلام مثله" . أقسام الأحاديث التي في السنن : ونجد ابن طاهر المقدسي – رحمه الله – هو الذي تكلم عن شروط الأئمة الستة ، فهو يقسم أحاديث سنن النسائي إلى ثلاثة أقسام : القسم الأول : أحاديث مخرجة في الصحيحين ، وأكثر الكتاب من هذا الباب . القسم الثاني : أحاديث صحيحة على شرط الشيخين . القسم الثالث : أحاديث أخرجها النسائي ، وأوضح علتها بطريقة يفهمها أهل الصنعة ؛ أي أنه قد يشير إلى علة الحديث إشارة واضحة ، وقد لا يشير إشارة واضحة ، ولكنها إشارة يفهمها أهل الصنعة، وذلك كأن يُورد الحديث مثلاً ، ثم يقول : ذكر اختلاف الناقلين لهذا الخبر عن فلان -الذي هو أحد الرواة الذين تدور عليهم أسانيد هذا الحديث - ، ثم يبدأ في بيان اختلاف في هذا الحديث بما يشير إلى أن هذا الحديث من الأحاديث المعلولة بسبب ذلك الاختلاف الوارد فيه . فبعض الناس قد لا يفهم صنيع النسائي هذا ، ولكنه يفهمه أهل الصنعة . منهجه : 1. اشترط إخراج أحاديث أقوام لم يجمع على تركهم إذا صح الحديث باتصال الإسناد من غير قطع ولا إرسال. 2. يحرص كل الحرص في الباب الواحد على إخراج الحديث الصحيح إذا وجده ، فإن لم يجد أخرج بعض الأحاديث الضعيفة التي يرى أن رواتها المضعفين ممن لم يجمع الأئمة على ضعفهم وترك أحاديثهم، ويتميز بشدة التحري. 3. قد يجد في الباب حديثاً صحيحاً ، فيذكر معه بعض الأحاديث الضعيفة، لأنها تضمنت زيادة لم ترد في الحديث الصحيح، أو ليبين ضعفها. 4. قد يخرج النسائي – رحمه الله – أحاديث ضعيفة ينبه في كثير من الأحيان على ضعفها ، وقد يفوته أو يسكت عن الكلام عن ضعفها . 5. جمع بين الصناعة الحديثية والفقهية، قال الإمام السخاوي: زاحم إمام الصنعة أبا عبد الله البخاري في تدقيق الاستنباط، والتبويب لما يستنبط. 6. تظهر صناعته الفقهية من خلال: أ. ترتيبه على أبواب الفقه. ب. وترجمته للأبواب. ج. وإيراده لبعض كلام الفقهاء، وإن كان قليلاً. د. يقتصر على موضع الشاهد ويختصر المتن. ل. أحياناً يورد كلاماً من عنده يدل على فقه الحديث، وقد يكون هذا الكلام طويلاً ، قد يصل نحو الصفحتين . هـ. يورد في بعض الأحيان الأحاديث المتعارضة في الباب الواحد لأنه يرى العمل بهذا وذاك. و. يكرر الأحاديث بحسب ما يناسب الأبواب، والتراجم. ي. يكرر الأبواب دون المتن 7. تظهر صناعته الحديثية من خلال: أ. حكمه على الأحاديث فيقول : هذا حديث منكر ، أو هذا حديث غير محفوظ، أو هذا حديث ليس بثابت ، أو هذا حديث صحيح . ب. عنايته بعلل الأحاديث ، فيورد الحديث من طرق متعددة على اختلاف الناقلين لهذاالحديث ، لكنه في البداية يورد الحديث من طريق ، ثم يبوب بعد ذلك باباً ، فيقول : "باب بيان اختلاف الناقلين للحديث عن فلان " مثلاً عن الأوزاعي ، ثم يبدأ يذكر الاختلاف على الأوزاعي ، مما يدل على أن كتابه هذا يعتبر من كتب العلل . ج. تكلمه على الرواة جرحا وتعديلا. 8. اقتصر على إيراد الأحاديث المسندة للرسول صلى الله عليه وسلم ومن دونه من الصحابة، ولا يورد شيئاً من الأحاديث المعلقة، وإنما وجد الذي صورته صورة المعلق في موضعين اثنين علق فيهما النسائي حديثين. 9. أعلى ما عنده رباعية الإسناد، وأنزل ما عنده عشارية، أي أن بينه وبين النبي صلى الله عليه وسلم عشرة رواة. 10. عنون أبوابا مستقلة لعلل الحديث وهذا من اهتمامه بالمسائل الخلافية في العلل. 11. يبين المهل، ويوضح المبهم، ويسمي المكنى، ويكني المسمى. 12. قلة التحويل. 13. يجيز الرواية بالمعنى. 14. يفسر الغريب أحيانا. 15. يشير إلى الأخوة، وإلى المفترق والمختلف. 16. يبين المنكر والمرسل والمنقطع والموقوف والمدرج. الفرق بينه وبين السنن الكبرى: 1. تفرد النسائي في الكبرى بذكر (21) كتابا لم يذكرها في المجتبى . 2. يورد في الكبرى طرقا ومتابعات لم يوردها في الصغرى . 3. نجد في الكبرى زيادات على الصغرى في تراجم الأبواب أو في الألفاظ أو السياق، كما أنه يمكن أن يختلف طول عنوان الباب بينهما تفصيلا أو إيجازا . 4. قد يضيف النسائي بعض الشروح على أحاديث المجتبى . 5. ليس صحيح قول القائل: كل حديث هو موجود في السنن الصغرى يوجد في السنن الكبرى لا محالة من غير عكس. 6. قد نجد اختلافات في المتن أو السند ولكنها غير مؤثرة كتأخير وتقديم أو زياد ونقص طفيف. فائدة: (إذا أطلق أهل الحديث على أن النسائي روى حديثا فإنما يريدون المجتبى لا السنن الكبرى) . [التعريف بالكتاب ، نقلا عن موقع : أهل الحديث]
