Repository: ahmetbasmaci/hadith_books
Catalog: lib/config/local/intl_*.arb
Languages: ar

# mishkatAlmasabihBookDescription
source: will add soon..
ar: مشكاة المصابيح أصله كتاب مصابيح السنة للبغوي، وهو كتاب جمع فيه صاحبه متون الأحاديث، وقام بترتيبها على طريقة كتب الجوامع، مع الحكم عليها بالصحة أو الحسن أو غيرها، فجاء كتابه مشتملا على أحاديث العقائد والعلم والعبادات والمعاملات والآداب والرقائق والفتن والفضائل والمناقب، لكنه يختلف عن الجوامع في خلوه من كتابي التفسير والمغازي . والخطيب التبريزي رحمه الله صاحب المشكاة كان معجبا بـ المصابيح حتى إنه قال عنه وكان كتاب المصابيح الذي صنفه الإمام محيي السنة وقامع البدعة أبو محمد الحسين بن مسعود الفراء البغوي رفع الله درجته أجمع كتاب صنف في بابه، وأضبط لشوارد الأحاديث وأوابدها . ولكنه مع إعجابه بالمصابيح رأى أنها بحاجة لاستدراك، فألف مشكاة المصابيح، وقام بتخريج أحاديثه، وذكر اسم الصحابي الراوي للحديث ؛ لأن البغوي لم يكن يذكر ذلك غالبا، وزاد فصلا ثالثا في كل باب. وقد قسم رحمه الله كل باب إلى فصول ثلاثة : الأول : ما أخرجه الشيخان أو أحدهما . الثاني : ما أورده غيرهما من الأربعة وأصحاب المسانيد والسنن. الثالث : ما اشتمل على معنى الباب من أحاديث وإن كانت موقوفة. يقول التبريزي رحمه الله: وقسمت كل باب غالبا على فصول ثلاثة : أولها ما أخرجه الشيخان , أو أحدهما واكتفيت بهما، وإن اشترك فيه الغير لعلو درجتهما في الرواية، وثانيها ما أورده غيرهما من الأئمة المذكورين , وثالهما ما اشتمل على معنى الباب من ملحقات مناسبة، مع محافظة على الشريطة، وإن كان مأثورا عن السلف والخلف . وقد زاد التبريزي على الأصل أكثر من ألف حديث، وقد اعتنى الناس بالمشكاة أيضا كأصله فوضعوا عليه شروحا عديدة ومختصرات مفيدة. والله أعلم.

# bookNameStr
source: Book Name
ar: اسم الكتاب

source: Chapter Name
ar: الباب

source: Hadith View Type
ar: طريقة عرض الأحديث

source: Change Hadith View Type
ar: تغيير طريقة عرض الأحديث

# selectignMultibleBooksNote
source: Note that selecting multiple books mey take some time to load
ar: اختيار عدة كتب قد يستغرق بعض الوقت للتحميل

source: Hadith Books
ar: كتب الأحاديث

source: Books Count
ar: عدد الأبواب

source: Hadiths Count
ar: عدد الأحاديث

source: Of The Book Have Been Readed
ar: تم قراءته من الكتاب

# openFavoritePageNote
source: Opening favorite page mey take time to load data for first time...
ar: فتح صفحة المفضلة قد يستغرق بعض الوقت لتحميل البيانات لأول مرة...
