Repository: ahmetbasmaci/hadith_books
Catalog: lib/config/local/intl_*.arb
Languages: ar

source: Copied to clipboard
ar: تم النسخ إلى الحافظة

source: Change Language
ar: تغيير اللغة

source: Language
ar: اللغة

source: Theme
ar: المظهر

source: Change Theme
ar: تغيير المظهر

source: Light
ar: فاتح

source: Dark
ar: داكن

source: All
ar: الكل

# appName
source: Hadith Encyclopedia
ar: موسوعة الأحاديث

source: Settings
ar: الإعدادات

source: Favorite
ar: المفضلة

source: Back
ar: الرجوع

source: Added to favorite
ar: تمت الإضافة إلى المفضلة

source: Removed from favorite
ar: تمت الإزالة من المفضلة

source: Error!!, Try Again
ar: خطأ!!، حاول مرة أخرى

source: Search
ar: بحث

source: Font Size
ar: حجم الخط

# fontSizeSubtitle
source: Change font size
ar: تعيين حجم الخط

source: Result Ended
ar: انتهت النتائج

source: Select Books to Search in
ar: أختر الكتب التي تود البحث فيها

source: Select All
ar: تحديد الكل

source: Close
ar: إغلاق

source: Confirm
ar: تأكيد

source: Please select at least one book
ar: الرجاء تحديد كتاب واحد على الأقل

source: Font size test text
ar: نص تجريبي

source: Read More
ar: قراءة المزيد

source: Read Less
ar: قراءة أقل

# appDeveloper
source: About App
ar: عن التطبيق

# aboutAppDiscreption
source: The Hadith Encyclopedia application is a non-profit and completely free application that allows users to access more than 15 books of the Prophet's hadiths with ease and convenience. The application is characterized by its simple design and ease of use, which makes it the ideal choice for anyone who wants to read the Prophet’s hadiths anytime, anywhere.
ar: تطبيق موسوعة الأحاديث هو تطبيق غير ربحي و مجاني تماما يتيح للمستخدمين الوصول إلى أكثر من 15 كتابًا من كتب الأحاديث النبوية الشريفة بسهولة وسرعة. يتميز التطبيق بتصميمه البسيط وسهولة الاستخدام، مما يجعله الخيار الأمثل لكل من يرغب في قراءة الأحاديث النبوية في أي وقت ومن أي مكان.

# contactMeOnEmail
source: Contact us on email
ar: تواصل معنا عبر البريد الإلكتروني

source: or by WhatsApp
ar: أو عبر واتساب

# appDeveloperDiscreption
source: Please if you have any questions or suggestions, do not hesitate to contact me.
ar: من فضلك إذا كان لديك أي أسئلة أو اقتراحات، لا تتردد في ارسال رسالة.

# emailMessage
source: Hello Ahmed,
ar: مرحبا أحمد,

# emailTitle
source: Note About Hadith App
ar: ملاحظة حول تطبيق الحديث

source: No Results Founded
ar: لم يتم العثور على نتائج

source: Select Books Filter
ar: أختر الكتب التي تود عرضها

source: Something Went Wrong!
ar: حدث خطأ ما!

# appDiscreption
source: Pray for the beloved
ar: صلِّ على الحبيب

source: Work without internet
ar: يعمل بدون اتصال بالإنترنت

# moreThen15OfHadithBookk
source: More than 15 Hadith books
ar: أكثر من 15 كتابًا من كتب الحديث

# quikSearch
source: Quick Search Feature
ar: ميزة البحث السريع

# saveReadingForward
source: Save Reading Progress
ar: حفظ مكان التقدم في القراءة

# workWithOutInternetDiscreption
source: You can access and read all books without the need for an internet connection
ar: يمكنك الوصول إلى جميع الكتب وقراءتها دون الحاجة إلى اتصال بالإنترنت

# moreThen15OfHadithBookkDiscreption
source: The application provides a wide range of books of the Prophet's hadiths
ar: يوفر التطبيق مجموعة واسعة من كتب الأحاديث النبوية الشريفة

# quikSearchDiscreption
source: You can search all books, a specific book, or even a chapter from a specific book quickly and easily
ar: يمكنك البحث في جميع الكتب أو في كتاب معين أو حتى في باب من كتاب معين بسرعة وسهولة

# saveReadingForwardDiscreption
source: This feature allows you to easily return to where you left off reading, making it easy for you to continue reading without losing your place. This feature is considered one of the most important features of the application
ar: تتيح لك هذه الميزة العودة إلى مكان توقفك في القراءة بسهولة، مما يسهل عليك مواصلة القراءة دون فقدان مكانك. هذه الميزة تعتبر من أهم مميزات التطبيق

source: No Ads
ar: لا يوجد إعلانات

# noAdsDiscreption
source: This App Complatly free and allows you to read all books without any ads, which makes it easy for you to read without any distractions.
ar: هذا التطبيق مجاني بالكامل كما يتيح لك قراءة جميع الكتب بدون أي إعلانات، مما يسهل عليك القراءة بدون أي تشتيت.

source: Skip
ar: تخطي

source: How are we?
ar: من نحن؟

source: About App
ar: عن التطبيق

source: About Developer
ar: عن المطور

# aboutDeveloperDiscreption
source: I am a software engineer who strives to develop innovative applications that provide free services to Muslims around the world, with a focus on facilitating the learning of the Prophet’s hadiths and enhancing access to Islamic knowledge. My work aims to connect Muslims with their religion more effectively by designing easy-to-use, high-quality programs that contribute to the dissemination of knowledge.
ar: أنا مهندس برمجيات أسعى لتطوير تطبيقات مبتكرة تقدم خدمات مجانية للمسلمين في جميع أنحاء العالم، مع التركيز على تسهيل تعلم الحديث النبوي الشريف وتعزيز الوصول إلى العلم الشرعي. يهدف عملي إلى ربط المسلمين بدينهم بشكل أكثر فعالية من خلال تصميم برامج سهلة الاستخدام وذات جودة عالية، مما يسهم في نشر المعرفة

source: Share App
ar: مشاركة التطبيق

# shareAppTitle
source: "Whoever guides [another] to a good deed will have a reward equal to the one who does it." - Prophet Muhammad (PBUH)
ar: قال رسول الله ﷺ الدَّالُّ على الخيرِ كفاعِلِه

# scrolllable
source: Scrollable
ar: عرض أفقي

source: List View
ar: عرض صفحات

source: Hadith Number
ar: رقم الحديث

source: Toggle Expanded All Texts
ar: توسيع جميع النصوص

# toggleExpandedAllTextsSubtitle
source: Expand or collapse all texts
ar: توسيع أو طي جميع النصوص

source: Book Info
ar: معلومات عن الكتاب

source: Imam Info
ar: ترجمة الإمام

# searchResultCount
source: Found {count} results
ar: تم العثور على {count} نتائج

# searchResultCountZeroHint
source: Please ensure that you type the full matched sentence in hadith text for accurate results
ar: الرجاء التأكد من كتابة الجملة الكاملة المطابقة لنص الحديث للحصول على نتائج دقيقة

# bukhariName
source: Imam Muhammad ibn Ismail al-Bukhari
ar: الإمام محمد بن إسماعيل البخاري

# bukhariDescription
source: Imam Muhammad ibn Ismail al-Bukhari is one of the greatest hadith scholars in Islam. He was born in Bukhara (in present-day Uzbekistan) in 194 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sahih al-Bukhari', which is considered one of the most authentic books after the Quran. He passed away in 256 AH. Imam al-Bukhari grew up in a scholarly environment as his father was a well-known scholar in Bukhara. After his father's death, his mother took care of his upbringing and ensured his education. Al-Bukhari memorized the Quran at a young age and then moved on to study hadith. At the age of sixteen, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Bukhari had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sahih al-Bukhari' is his most famous work, containing over 7000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sahih al-Bukhari', Imam al-Bukhari wrote many other books such as 'Al-Adab Al-Mufrad' and 'Al-Tarikh Al-Kabir'. Al-Bukhari was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 256 AH in Samarkand (in present-day Uzbekistan) and was buried there. Imam al-Bukhari is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: البُخاري (١٩٤ - ٢٥٦ هـ = ٨١٠ - ٨٧٠ م) محمد بن إسماعيل بن إبراهيم بن المغيرة البخاري، أبو عبد الله • حبر الإسلام، والحافظ لحديث رسول الله صلّى الله عليه وسلم • ولد في بخارى، ونشأ يتيما، وقام برحلة طويلة (سنة ٢١٠) في طلب الحديث، فزار خراسان والعراق ومصر والشام، وسمع من نحو ألف شيخ، وجمع نحو ست مئة ألف حديث اختار منها في صحيحه ما وثق برواته. وهو أول من وضع في الإسلام كتابا على هذا النحو. • وأقام في بخارى، فتعصب عليه جماعة ورموه بالتهم، فأخرج إلى خَرْتنْك (من قرى سمرقند) فمات فيها. • وكتابه في الحديث أوثق الكتب الستة المعول عليها، وهي: صحيح البخاري (صاحب الترجمة) وصحيح مسلم (٢٠١ - ٢٦١ هـ) وسنن أَبي داوُد (٢٠٢ - ٢٧٥ هـ) وسنن الترمذي (٢٠٩ - ٢٧٩ هـ) وسنن ابن مَاجَهْ (٢٠٩ - ٢٧٣ هـ) وسنن النسائي (٢١٥ - ٣٠٣ هـ) صاحب: • (الجامع الصحيح - ط) المعروف بصحيح البخاري • (التاريخ - ط) أجزاء منه • (الضعفاء - ط) في رجال الحديث • (خلق أفعال العباد - ط) • (الأدب المفرد - ط). • ولشيخنا محمد جمال الدين القاسمي (حياة البخاري - ط) (١). _________ (١) تذكرة الحفاظ ٢: ١٢٢ وتهذيب التهذيب ٩: ٤٧ والوفيات ١: ٤٥٥ وتاريخ بغداد ٢: ٤ - ٣٦ وتهذيب الأسماء واللغات، القسم الأول من الجزء الأول ٦٧ والسبكي ٢: ٢ والخميس ٢: ٣٤٢ وآداب اللغة ٢: ٢١٠ ودائرة المعارف الإسلامية ٣: ٤١٩ - ٤٢٦ وطبقات الحنابلة ١: ٢٧١ - ٢٧٩ ومعجم المطبوعات ٥٣٤ وانظر هدى الساري مقدمة فتح البخاري ٢: ١٩٣ - ٢٠٦ وفي مجلة (العرب) الباكستانية (رمضان ١٣٧٩) أن قبر البخاري اندثر وبني مكانه قبر آخر، وهو في قرية تعرف الآن بقرية (خواجه صاحب) على ٣٠ كيلومترا من سمرقند، في طريق بخارى. نقلا عن: «الأعلام» للزركلي

# muslimName
source: Imam Muslim ibn al-Hajjaj al-Naysaburi
ar: الإمام مسلم بن الحجاج القشيري النيسابوري

# muslimDescription
source: Imam Muslim ibn al-Hajjaj is one of the greatest hadith scholars in Islam. He was born in Nishapur (in present-day Iran) in 206 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sahih Muslim', which is considered one of the most authentic books after the Quran and Sahih al-Bukhari. He passed away in 261 AH. Imam Muslim grew up in a scholarly environment as his father was a well-known scholar in Nishapur. After his father's death, his mother took care of his upbringing and ensured his education. Muslim memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Muslim had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sahih Muslim' is his most famous work, containing over 7000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sahih Muslim', Imam Muslim wrote many other books such as 'Al-Kuna wa al-Asma' and 'Al-Tabaqat'. Muslim was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 261 AH in Nishapur and was buried there. Imam Muslim is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: الإمام مسلم بن الحجاج هو أحد أعظم علماء الحديث في الإسلام. وُلد في نيسابور (في إيران الحالية) في عام 206 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'صحيح مسلم'، الذي يُعتبر أحد أصح الكتب بعد القرآن الكريم وصحيح البخاري. توفي في عام 261 هـ. الإمام مسلم نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في نيسابور. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ مسلم في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان مسلم يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'صحيح مسلم' هو أشهر أعماله، ويحتوي على أكثر من 7000 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'صحيح مسلم'، كتب الإمام مسلم العديد من الكتب الأخرى مثل 'الكنى والأسماء' و'الطبقات'. كان مسلم يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 261 هـ في نيسابور ودفن هناك. يُعتبر الإمام مسلم رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.

# abudawudName
source: Imam Sulayman ibn al-Ash'ath Abu Dawud al-Sijistani
ar: الإمام سليمان بن الأشعث أبو داود السجستاني

# abudawudDescription
source: Imam Sulayman ibn al-Ash'ath Abu Dawud is one of the greatest hadith scholars in Islam. He was born in Sijistan (in present-day Iran) in 202 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sunan Abu Dawud', which is considered one of the six authentic books of hadith. He passed away in 275 AH. Imam Abu Dawud grew up in a scholarly environment as his father was a well-known scholar in Sijistan. After his father's death, his mother took care of his upbringing and ensured his education. Abu Dawud memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Abu Dawud had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sunan Abu Dawud' is his most famous work, containing over 4800 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sunan Abu Dawud', Imam Abu Dawud wrote many other books such as 'Al-Marasil' and 'Al-Nasikh wa al-Mansukh'. Abu Dawud was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 275 AH in Basra (in present-day Iraq) and was buried there. Imam Abu Dawud is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: الإمام سليمان بن الأشعث أبو داود هو أحد أعظم علماء الحديث في الإسلام. وُلد في سجستان (في إيران الحالية) في عام 202 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'سنن أبي داود'، الذي يُعتبر أحد الكتب الستة الصحيحة في الحديث. توفي في عام 275 هـ. الإمام أبو داود نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في سجستان. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ أبو داود في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان أبو داود يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'سنن أبي داود' هو أشهر أعماله، ويحتوي على أكثر من 4800 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'سنن أبي داود'، كتب الإمام أبو داود العديد من الكتب الأخرى مثل 'المراسيل' و'الناسخ والمنسوخ'. كان أبو داود يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 275 هـ في البصرة (في العراق الحالية) ودفن هناك. يُعتبر الإمام أبو داود رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.

# tirmidhiName
source: Imam Tirmidhi
ar: الإمام الترمذي

# tirmidhiDescription
source: Imam Abu Isa Muhammad ibn Isa al-Tirmidhi. He was born in Termez (in present-day Uzbekistan) in 209 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Al-Shama'il al-Muhammadiyya', which is considered one of the most important books in hadith. He passed away in 279 AH. Imam al-Tirmidhi grew up in a scholarly environment as his father was a well-known scholar in Termez. After his father's death, his mother took care of his upbringing and ensured his education. Al-Tirmidhi memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Tirmidhi had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Al-Shama'il al-Muhammadiyya' is his most famous work, containing over 400 hadiths. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Al-Shama'il al-Muhammadiyya', Imam al-Tirmidhi wrote many other books such as 'Al-Jami' al-Kabir' and 'Al-Jami' al-Saghir'. Al-Tirmidhi was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 279 AH in Termez and was buried there. Imam al-Tirmidhi is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: الإمام أبو عيسى محمد بن عيسى الترمذي. وُلد الإمام الترمذي في ترمذ (في أوزبكستان الحالية) في عام 209 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'الشمائل المحمدية'، الذي يُعتبر أحد أهم الكتب في الحديث. توفي في عام 279 هـ. الإمام الترمذي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في ترمذ. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ الترمذي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان الترمذي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'الشمائل المحمدية' هو أشهر أعماله، ويحتوي على أكثر من 400 حديث. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'الشمائل المحمدية'، كتب الإمام الترمذي العديد من الكتب الأخرى مثل 'الجامع الكبير' و'الجامع الصغير'. كان الترمذي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 279 هـ في ترمذ ودفن هناك. يُعتبر الإمام الترمذي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.

# nasaiName
source: Imam Ahmad ibn Shu'ayb al-Nasa'i
ar: الإمام أبو عبد الرحمن أحمد بن شعيب النسائي

# nasaiDescription
source: Imam Ahmad ibn Shu'ayb al-Nasa'i is one of the greatest hadith scholars in Islam. He was born in Nasa (in present-day Turkmenistan) in 215 AH. He began collecting hadiths at a young age and traveled to many countries to gather authentic hadiths. His most famous work is 'Sunan al-Nasa'i', which is considered one of the six authentic books of hadith. He passed away in 303 AH. Imam al-Nasa'i grew up in a scholarly environment as his father was a well-known scholar in Nasa. After his father's death, his mother took care of his upbringing and ensured his education. Al-Nasa'i memorized the Quran at a young age and then moved on to study hadith. At the age of twenty, he embarked on his scholarly journey to Mecca to perform Hajj, where he began collecting hadiths. He then traveled to many countries such as Iraq, Egypt, and the Levant to gather hadiths from scholars. Al-Nasa'i had a strong memory and an exceptional ability to memorize, which helped him in collecting and classifying hadiths. He was keen on verifying the authenticity of hadiths by studying the chain of narrators and ensuring their reliability and accuracy. 'Sunan al-Nasa'i' is his most famous work, containing over 7000 hadiths, with around 2600 hadiths without repetition. This book is considered a fundamental reference in the science of hadith and is studied worldwide. In addition to 'Sunan al-Nasa'i', Imam al-Nasa'i wrote many other books such as 'Al-Sunan al-Kubra' and 'Al-Du'afa wa al-Matrukin'. Al-Nasa'i was known for his high morals and great humility, and he was keen on spreading knowledge and teaching people. He passed away in 303 AH in Ramla (in present-day Palestine) and was buried there. Imam al-Nasa'i is considered a symbol of knowledge and piety and is celebrated in the Islamic world as one of the greatest hadith scholars.
ar: الإمام أحمد بن شعيب النسائي هو أحد أعظم علماء الحديث في الإسلام. وُلد في نسا (في تركمانستان الحالية) في عام 215 هـ. بدأ في جمع الأحاديث في سن مبكرة وسافر إلى العديد من البلدان لجمع الأحاديث الصحيحة. أشهر أعماله هو 'سنن النسائي'، الذي يُعتبر أحد الكتب الستة الصحيحة في الحديث. توفي في عام 303 هـ. الإمام النسائي نشأ في بيئة علمية حيث كان والده من العلماء المعروفين في نسا. بعد وفاة والده، تولت والدته تربيته وحرصت على تعليمه. بدأ النسائي في حفظ القرآن الكريم في سن مبكرة، ثم انتقل إلى دراسة الحديث. في سن العشرين، بدأ رحلته العلمية إلى مكة المكرمة لأداء فريضة الحج، وهناك بدأ في جمع الأحاديث. بعد ذلك، سافر إلى العديد من البلدان مثل العراق، مصر، والشام لجمع الأحاديث من العلماء. كان النسائي يتمتع بذاكرة قوية وقدرة فائقة على الحفظ، مما ساعده في جمع وتصنيف الأحاديث. كان يحرص على التحقق من صحة الأحاديث من خلال دراسة سلسلة الرواة والتأكد من عدالتهم وضبطهم. 'سنن النسائي' هو أشهر أعماله، ويحتوي على أكثر من 7000 حديث، منها حوالي 2600 حديث بدون تكرار. يُعتبر هذا الكتاب مرجعاً أساسياً في علم الحديث ويُدرس في جميع أنحاء العالم الإسلامي. بالإضافة إلى 'سنن النسائي'، كتب الإمام النسائي العديد من الكتب الأخرى مثل 'السنن الكبرى' و'الضعفاء والمتروكين'. كان النسائي يتمتع بأخلاق عالية وتواضع كبير، وكان يحرص على نشر العلم وتعليم الناس. توفي في عام 303 هـ في الرملة (في فلسطين الحالية) ودفن هناك. يُعتبر الإمام النسائي رمزاً للعلم والتقوى، ويُحتفى به في العالم الإسلامي كأحد أعظم علماء الحديث.

# ibnmajahName
source: Imam Muhammad ibn Yazid Ibn Majah al-Qazwini
ar: الإمام محمد بن يزيد بن ماجه القزويني
