Repository: ahmetbasmaci/hadith_books
Catalog: lib/config/local/intl_*.arb
Languages: ar

# ibnmajahBookDescription
source: will add soon..
ar: منزلته بين سائر الكتب الستة : أول من أضافه إلى الخمسة مكملاً به الستة أبو الفضل محمد بن طاهر المقدسي ( ت 507هـ ) في كتابه " أطراف الكتب الستة" ، وكذا في "شروط الأئمة الستة" له ، ثم الحافظ عبد الغني بن عبد الواحد المقدسي في كتابه" الكمال في أسماء الرجال" . قال ابن طاهر : ولعمري من نظر فيه علم منزلة الرجل : من حسن الترتيب ، وغزارة العلم ، وقلة الأحاديث ، وترك التكرار . وقال أيضاً : وسنن ابن ماجه وإن لم يشتهر عند أكثر الفقهاء فإن له بالري وما والاها من " ديار الجبل" و " قوهستان" .. شأن عظيم عليه اعتمادهم وله عندهم طرق كثيرة . اهـ وقال الحافظ ابن كثير : ابن ماجه القزويني صاحب السنن .. وهي دالة على عمله وعلمه وتبحره واطلاعه واتباعه للسنة في الأصول والفروع . مجمل منهجه و طريقة ترتيبه : 1 ــ رتبه على الأبواب الفقهية . 2 ــ بدأه بمقدمة في الإيمان و العلم ذكر فيها ( 24 ) باباً ، و ( 266) حديثاً ، ثم أبواب العبادات ثم أبواب النكاح و الطلاق وسائر الأبواب الفقهية . 3 ــ جرده للحديث المرفوع ، ونادراً ما يذكر فيه الآثار على الصحابة أو التابعين . 4 ــ لا يكرر الأحاديث في كتابه ، ولا يعلقها إلا في القليل النادر . 5 ــ يقدم في الباب الأحاديث القوية ، ويجعل الضعيفة بدرجاتها في خاتمة الباب(2) . من أمثلة ذلك : الباب الأول من كتاب الطهارة ، باب ماجاء في مقدار الوضوء ، ذكر فيه حديث ( كان رسول الله صلى الله عليه وسلم يتوضأ بالمد ، ويغتسل بالصاع ) عن أربعة من الصحابة أولها وافقه الإمام مسلم في " تخريجه" ، والثاني و الثالث وافقه أصحاب السنن في تخريجه ، والرابع تفرد به ابن ماجه عن سائر الستة الباب الثاني من كتاب الطهارة ، باب لا يقبل الله صلاة بغير طهور ذكر فيه حديث ( لا يقبل الله صلاة بغير طهور ) عن أربعة من الصحابة الأول وافقه فيه أصحاب السنن الثلاثة ، و الثاني وافقه فيه مسلم ، و الثالث و الرابع تفرد بهما ابن ماجه(3). الباب الثالث من كتاب الطهارة ، باب مفتاح الصلاة الطهور ذكر فيه حديثين ، الأول حديث علي رضي الله عنه وافقه عليه أصحاب السنن الثاني حديث أبي سعيد الخدري وافقه عليه أصحاب السنن قال الترمذي : حديث علي هو أصح شيء في الباب . وقال في موضع آخر : وحديث علي أجود إسناداً وأصح من حديث أبي سعيد . 6 ــ يقتصر على الحديث الضعيف أو الواهي إذا لم يكن في الباب إلا هو . 7 ــ غالب الأحاديث الواهية و الساقطة في أبواب الترغيب و الترهيب و الفضائل ونحو ذلك . 8 ــ له تعليقات معدودة على بعض الأحاديث في النقد و التعليل 9 ــ راوي السنن أبو الحسن بن القطان له زيادات وتعليقات قليلة ضمن " سنن ابن ماجه" يصدرها بقوله ( قال أبو الحسن ) ، انظر ( رقم/22، 84 ، 241 ، 252 ، 256 ، 261) ، وقد جمعها د . مسفر الدميني في جزء لطيف . قال الذهبي : وفي غضون كتابه أحاديث، يعلها صاحبه الحافظ أبو الحسن بن القطان . عدد أحاديثه وكتبه : عدد أحاديثه : ( 4341) حديثاً ، منها ( 3002) أخرجها بقية الستة . عدد كتبه : (37) باباً ، بدأها بمقدمة في الإيمان ، وختمها بكتاب الزهد . أفراد ابن ماجه عن الستة : قال ابن حجر : وجدت بخط الحافظ شمس الدين محمد بن علي الحسيني مالفظه سمعت شيخنا الحافظ أبا الحجاج المزي يقول : كل ما انفرد به ابن ماجه فهو ضعيف، يعني بذلك ما انفرد به من الحديث عن الأئمة الخمسة انتهى ما وجدته بخطه، قال ابن حجر : وحمله على الرجال أولى، وأما حمله على الأحاديث فلا يصح . يريد ابن حجر أن الضعف يكون في أحد الطرق، وأن الحديث قد يكون قوياً بشواهده . وذكر المحقق الأستاذ محمد فؤاد عبد الباقي إحصائية (1)لهذه الأحاديث وهي : زوائده على سائر الستة ( 1339) وهي على النحو التالي : ( 428) حديثاً رجالها ثقات ، صحيحة الإسناد . ( 199) حديثاً حسنة الإسناد . ( 613) حديثاً ضعيفة الإسناد . ( 99) حديثاً واهية الإسناد أو منكرة أو مكذوبة. بيان شرطه و منزلة رجاله : الكتاب يشتمل على : 1- أنواع الحديث الثلاثة : ( الصحيح و الحسن و الضعيف) 2- يوجد أحاديث واهية ضعيفة جداً . 3- يوجد أحاديث موضوعة لكنها قليلة ، ومن أشهرها الحديث الوارد في فضل قزوين : (وهو رقم/2780) فقد روى بسنده عن أنس بن مالك قال : قال رسول الله صلى الله عليه وسلم : (ستفتح عليكم الآفاق ، وستفتح عليكم مدينة يقال لها قزوين ، من رابط فيها أربعين يوما أو أربعين ليلة ، كان له في الجنة عمود من ذهب ، عليه زبرجدة خضراء ، عليها قبة من ياقوتة حمراء ، لها سبعون ألف مصراع من ذهب ، على كل مصراع زوجة من الحور العين) . ففي إسناد هذا الحديث داود بن المحبر : متروك الحديث ورمي بالكذب ، قال ابن حجر : روى له ابن ماجة حديث في فضل قزوين وهو منكر يقال انه ادخل عليه اهـ . قال الذهبي في " ميزان الاعتدال" (2/20) : فلقد شان ابن ماجة سننه بإدخاله هذا الحديث الموضوع فيها. وقال الذهبي أيضاً : وأما أهل الطبقة الخامسة، كمن أجمع على اطراحه وتركه لعدم فهمه وضبطه، أو لكونه متهما، فيندر أن يخرج لهم أحمد والنسائي ، ويورد لهم أبو عيسى فيبينه بحسب اجتهاده، لكنه قليل ، ويورد لهم ابن ماجه أحاديث قليلة ولا يبين - والله أعلم -. وقل ما يورد منها أبو داود، فإن أورد بينه في غالب الأوقات . وأما أهل الطبقة السادسة كغلاة الرافضة والجهمية الدعاة، وكالكذابين والوضاعين، وكالمتروكين المهتوكين، كعمر بن الصبح، ومحمد المصلوب، ونوح بن أبي مريم، وأحمد الجويباري، وأبي حذيفة البخاري، فما لهم في الكتب حرف، ما عدا عمر، فإن ابن ماجه خرج له حديثاً واحداً فلم يصب ، وكذا خرج ابن ماجه للواقدي حديثاً واحداً . [التعريف بالكتاب ، نقلا عن موقع : الألوكة]

# malikBookDescription
source: will add soon..
ar: المُوَطّأ وكان كتاب مالك، أفضل وأعظم نفعاً وأكثر تأثيرا من كل الكتب التي ألفت حتى ذلك الوقت، لجأ الخليفة أبي جعفر المنصور (ت158هـ) إلى الإمام مالك في موسم الحج طالبا منه تأليف كتاب في الفقه يجمع الشتات وينظم التأليف بمعايير علمية حدّدها له قائلا: "يا أبا عبد الله ضع الفقه ودوّن منه كتبا وتجنّب شدائد عبد الله بن عمر، ورخص عبد الله بن عباس، وشوارد عبد الله بن مسعود، واقصد إلى أواسط الأمور، وما اجتمع إليه الأئمة والصحابة، لتحمل الناس إن شاء الله على عملك، وكتبك، ونبثها في الأمصار ونعهد إليهم ألا يخالفوها". وقد طلب المنصور من الإمام مالك أن يجمع الناس على كتابه، فلم يجبه إلى ذلك، وذلك من تمام علمه واتصافه بالإنصاف، وقال: "إن الناس قد جمعوا واطلعوا على أشياء لم نطلع عليها" من علوم الحديث للحافظ ابن كثير. منهجه العلمي : كتاب الإمام مالك هو أجلّ كتب الحديث المتقدمة عليه وأعظمها نفعاً بلا شك، فيه الأحاديث الصحيحة المسندة، وإن كان الكتاب ليس بالكبير، فيه البلاغات والمنقطعات والمراسيل، ولا يستدرك على الإمام مالك في ذلك؛ لأنه يرى حجية المرسل، وهذه البلاغات وصلها ابن عبد البر في التمهيد سوى أربعة أحاديث، كما هو معروف. اعتنى أهل العلم بالموطأ عناية فائقة لإمامة مؤلفه، ولعظم نفعه، ولاختصاره أيضاً يعني شرحه متيسر. من علوم الحديث للحافظ ابن كثير وكان الإمام مالك متحريا في الرواية منتقيا للرجال أحسن الانتقاء منتقدا للرجال أشد الانتقاد، لذلك جعله أهل الحديث آنذاك مصدرا حديثيا معتمدا عليه في الاحتجاج بأحاديثه من حيث الجملة - مع أن فيه المرسل والبلاغ - حتى ظهر صحيح الإمام البخاري الذي تقدم على الموطأ في الصحة وذلك لأن الإمام البخاري جرد صلب الكتاب من البلاغات والمراسيل وإنما ذكرها في تراجم الأبواب على سبيل الاستشهاد بها لا أكثر، والمعول في كتابه على أحاديث الصلب لا التراجم. ومع تقدم صحيح البخاري في الصحة, لم يفقد الموطأ تلك المكانة كمصدر من مصادر السنة المشهورة ذات المكانة المرموقة. وفي رواية أبي مصعب الزهري 3069 رواية عن الإمام مالك . أقوال العلماء عن الموطأ : قال الإمام الشافعي: «ما كتاب بعد كتاب الله أنفع من كتاب مالك بن أنس». وهذا القول قبل ظهور صحيح البخاري. قال البخاري "أصح الأسانيد كلها: مالك عن نافع عن ابن عمر"، وكثيرا ما ورد هذا الإسناد في الموطأ. قال القاضي أبو بكر بن العربي في شرح الترمذي: الموطأ هو الأصل واللباب وكتاب البخاري هو الأصل الثاني في هذا الباب، وعليهما بنى الجميع كمسلم والترمذي. التعليقات على الموطأ : علقوا عليه كتباً جمة، ومن أجود ذلك كتابا: (التمهيد – والاستذكار) للشيخ أبي عمر بن عبد البر النَّمَري القرطبي، هذا مع ما فيه من الأحاديث المتصلة الصحيحة والمرسلة والمنقطعة والبلاغات اللاتي لا تكاد توجد مسندة إلا على ندور. كتابا (التمهيد والاستذكار) لابن عبد البر من أنفس ما كتب في شروح الأحاديث، والإمام ابن عبد البر مكث ثلاثين سنة في تأليف التمهيد، ولذا جاء على هذا الوضع المتقن المحرر، وهو يعتني في هذا الكتاب بالمعاني، معاني الأحاديث وأسانيدها والروايات، وكتابه الآخر (الاستذكار) وهو أيضاً من أجود ما كتب في فقه السنة، وعناية المؤلف فيه بالفقه، وأقوال فقهاء الأمصار. هناك شروح أخرى للموطأ جيدة ونفيسة مثل: (المنتقى) للباجي، و(أوجز المسالك) للكندهلوي وهو كتاب طيب مطبوع متداول، و(تنوير الحوالك) كتاب مختصر للسيوطي، و شرح الزرقاني شرح متوسط، وهناك شرح لولي الله الدهلوي اسمه (المسوى شرح الموطأ) وله شرح آخر اسمه (المصفى) لكنه بالفارسية، أما (المسوى) هو بالعربية كتاب نافع على اختصاره الشديد. من علوم الحديث للحافظ ابن كثير. رواته : روى الموطأ عن مالك جمع غفير من الرواة منهم معن بن عيسى، ومحمد بن الحسن الشيباني صاحب أبي حنيفة، وابن بكير وابن غفير، والصوري، ويحيى بن يحيى، وعلي بن زياد وغيرهم. ومن أشهر الرواة الذين رووا الموطأ (علي بن زياد) التونسي العبسي المتوفي سنة 183هـ. وهو من خبرة علماء المغرب وأجلهم، طلب العلم، ورحل بسببه إلى الحجاز والعراق، وهو ثقة مأمون، بارع في الفقه، لم يكن بعصره له شبيه. [التعريف بالكتاب ، نقلاً عن موقع : ويكيبيديا]

# ahmedBookDescription
source: will add soon..
ar: [مسند أحمد بن حنبل] طريقة ترتيبه: ‏ رتبه رحمه الله على قدر سابقة الصحابي في الإسلام ومحله من الدين، فبدأ بالعشرة مقدماً الخلفاء على غيرهم، ثم أهل بدر، ثم أهل الحديبية .... وهكذا. ‏ مكانة هذا المسند: ‏ قال حنبل: "جمعنا أحمد بن حنبل أنا وصالح وعبدالله وقرأ علينا المسند وماسمعه غيرنا ، وقال: "هذا الكتاب جمعته وانتقيته من أكثر من سبعمائة ألف حديث وخمسين ألف، ومااختلف فيه المسلمون من حديث رسول الله صلى الله عليه وسلم فارجعوا إليه، فإن وجدتموه وإلا فليس بحجة ". ‏ ‎‎ وقال أبو موسى محمد بن أبي بكر المديني: "وهذا الكتاب أصل كبير، ومرجع وثيق لأصحاب الحديث انتقى من حديث كثير ومسموعات وافرة، فجعله إماماً ومعتمداً وعند التنازع ملجأ ومستنداً ". ‏ عدد أحاديث المسند: ‏ ‎‎بالمكرر أربعون ألف حديث، وبدون المكرر ثلاثون ألف حديث. ‏ عدد الصحابة المخرجة مسانيدهم في المسند: ‏ قال أبو موسى: "فأما عدد الصحابة فنحو سبعمائة رجل ومن النساء مائة ونيف .... " ‏ وقال ابن الجزري: "قد عددتهم فبلغوا ستمائة ونيفاً وتسعين سوى النساء، وعددت النساء فبلغن ستاً وتسعين، واشتمل المسند على نحو ثمانمائة من الصحابة، سوى مافيه ممن لم يسم من الأبناء والمبهمات وغيرهم ". ‏ وقال الحافظ في مقدمة تعجيل المنفعة: "ليس في مسند أحمد حديث لاأصل له إلا ثلاثة أحاديث أو أربعة، منها حديث عبدالرحمن بن عوف: أنه يدخل الجنة زحفاً، والاعتذار عنه أنه مما أمر الإمام أحمد بالضرب عليه فترك سهواً ". ‏ عناية العلماء بالمسند: ‏ 1. رتبه على معجم الصحابة والرواة عنهم كترتيب كتب الأطراف الحافظ أبو بكر محمد بن عبدالله بن المحب الصامت. ‏ 2. أخذ الحافظ أبو الفداء عماد الدين إسماعيل بن عمر بن كثير كتاب المسند بترتيب ابن المحب الصامت، وضم إليه الكتب الستة، ومسند البزار، ومسند أبي يعلى الموصلي، ومعجم الطبراني الكبير، ورتبها جميعاً على نفس ترتيب ابن المحب للمسند، وسماه: "جامع المسانيد والسنن ". ‏ 3. رتبه الحافظ ابن حجر أيضاً على الأطراف وسماه: "أطراف المُسنِد - بضم الميم وكسر النون وضم الميم - المعتلي بأطراف المسند الحنبلي " ثم ضمه أيضاً مع الكتب العشرة في كتابه "إتحاف السادة المهرة الخيرة بأطراف الكتب العشرة ". ‏ 4. ترجم لرجاله الحافظ شمس الدين الحسيني في كتابه "الإكمال بمن في مسند أحمد من الرجال ممن ليس في تهذيب الكمال للمزي " ثم ترجم لرجاله أيضاً ضمن كتابه "التذكرة برجال العشرة " وهي: الكتب الستة، وموطأ مالك، ومسند أحمد، ومسند الشافعي، ومسند أبي حنيفة، وقد اختصره الحافظ في تعجيل المنفعة، مقتصراً على رجال الأربعة. ‏ 5. رتبه الشيخ أحمد بن عبدالرحمن الساعاتي على الكتب والأبواب ليسهل بذلك على طلبة العلم الاستفادة من المسند وسماه "الفتح الرباني بترتيب مسند الإمام أحمد بن حنبل الشيباني " ثم عاد وشرحه وخرج أحاديثه في كتاب سماه "بلوغ الأماني من أسرار الفتح الرباني ". ‏ 6. اعتنى بالمسند أيضاً الشيخ أحمد بن محمد شاكر فشرح غريبه وحكم على أحاديثه صحةً وضعفاً بما أوصله إليه اجتهاده، ثم صنع له فهارس قسمها إلى قسمين: فهارس لفظية كفهارس الأعلام ونحوها، وفهارس علمية كتلك التي صنعها في الرسالة للشافعي، وقد توفي رحمه الله تعالى قبل أن يكمله إذ بلغ الربع تقريباً. [التعريف بالكتاب ، نقلا عن موقع : دليل المسلم]

# riyadAssalihinBookDescription
source: will add soon..
ar: جمع فيه أحاديث في الترغيب والترهيب والزهد والراقائق والآداب . ويعتبر من أحد الكتب القيمة التي تصلح كمنهج عملي لتربية المسلم بترغيبه في أبواب الخير وتحذيره من أبواب الشر، وقد اعتمد فيه الإمام النووي على الآيات القرآنية والأحاديث النبوية، والكتاب يجمع بين دفتيه ما يقرب من ألفي حديث شريف . [التعريف بالكتاب ، نقلاً عن موقع : شبكة مشكاة الإسلامية]

# nawawi40BookDescription
source: will add soon..
ar: الأربعون في مباني الإسلام وقواعد الأحكام المعروفة بـ الأربعون النووية، متن اشتمل على اثنين وأربعين حديثاّ جمعها يحيى بن شرف النووي المتوفى ٦٧٦ هـ. الأربعون النووية هي أشهر كتب الأربعينات التى ظهرت استنادا على حديث ضعيف يقول «مَنْ حَفِظَ عَلَى أُمَّتِي أَرْبَعِينَ حَدِيثًا مِنْ أَمْرِ دِينِهَا بَعَثَهُ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ فِي زُمْرَةِ الْفُقَهَاءِ وَالْعُلَمَاءِ». وعلل النووي سبب جمعه للأربعين فقال: «من العلماء من جمع الأربعين في أصول الدين، وبعضهم في الفروع وبعضهم في الجهاد، وبعضهم في الزهد وبعضهم في الخطب، وكلها مقاصد صالحة، رضي الله عن قاصديها. و قد رايت جمع أربعين أهم من هذا كله، وهي اربعون حديثاً مشتملةً على جميع ذلك، وكل حديث منها قاعدة عظيمة من قواعد الدين، وقد وصفه العلماء بأنه مدار الإسلام عليه، أو يصف الإسلام أو ثلثه أو نحو ذلك. » ثم ألتزم في هذه الأربعين أن تكون صحيحة، وحذف أسانيدها ليسهل حفظها، ثم أتبعها بباب في ضبط خفيّ ألفاظها. فرغ المؤلف من تأليفها ليلة الخميس ٢٩ جمادى الأول سنة ٦٦٨ هـ . [التعريف بالكتاب ، نقلاً عن موقع : شبكة مشكاة الإسلامية]

# shamailMuhammadiyahBookDescription
source: will add soon..
ar: يعتبر كتاب الشمائل المحمدية أحد الكتب التي تتكلم عن السيرة النبوية, يوجد الكثير من الكتب التي تتحدث عن السيرة النبوية, ولكن هذا الكتاب يحتوى على العديد من الأحاديث النبوية الصحيحة, وقام بتأليف هذا الكتاب أحد الأئمة العظماء الذي جاهدوا في طلب العلم. هذا الكتاب من المراجع التي يستخدمها علماء الأزهر في مراجعة الأحاديث ومعرفة الحياة النبوية, وأيضاً يوضح لنا المؤلف جميع الشمائل الخاصة بالنبي صلى الله عليه وسلم, كما احتفظ بداخل هذا الكتاب على العديد من الأحاديث النبوية سواء كانت هذه الأحاديث كانت قولية أو فعلية من الرسول صلى الله عليه وسلم. وقد قام المؤلف أيضاً بعمل باب مختصاً في الكتاب لشرح بعض النصوص التي وردت في الكتاب لإيضاحها, كما جمع أيضاً في كتابه الأحاديث التي تناقلت من الصحابة والتابعين مع ذكر اسم الصحابي الجليل الذي قام بذكر الحديث. نال هذا الكتاب إعجاب الكثيرين من القراء والأدباء والمثقفين حيث تم اعتباره من أمهات الكتب, حيث تم استخدامه كمرجع مهم في السيرة النبوية, لأن المؤلف يحدثنا فيه عن جميع سلوكيات رسولنا الكريم, ويوضح لنا صفات النبي سواء كانت الخلفية أو الخُلقية.

# bulughAlmaramBookDescription
source: will add soon..
ar: قد اشتَملَ كتابُ "بلوغ المرام من أدلة الأحكام"؛ للإمام الحافظ أبي الفضل أحمد بن عليِّ بن محمد الكناني الشافعي، المعروف بابن حجرٍ العسقلاني، المتوفَّى سنة (852 هـ) على أصولِ الأدلَّة الحديثيَّة للأحكام الشرعيَّة؛ فقد حرَّرَه ابنُ حجرٍ- رحمه الله- تحريرًا بالغًا؛ ليكون بدايةً للطريق للطالب المبتدئ، واستزادةً لِمَن وصَل في هذا العِلم إلى أعْلى الدرجات. ويتَّضح ذلك ممَّا قاله ابنُ حجرٍ نفسُه في مقدمة كتابه، حيث قال: "أمَّا بعدُ، فهذا مختصَرٌ يشتمِل على أصولِ الأدلَّة الحديثيَّة للأحكام، حرَّرتُه تحريرًا بالغًا؛ ليصيرَ مَن يحفَظُه مِن بيْن أقرانه نابِغًا، ويَستعين به الطالِبُ المبتدِي، ولا يَستغني عنه الراغبُ المنتهي". ومن هنا جاءتْ أهميَّة الكتاب، فهو يُعَدُّ مِن أهم كتب الأحكام، بل يصل إلى درجةِ النفائس. وقد اتَّبَع ابن حجرٍ- رحمه الله- في ترتيبه لكتابه طريقةَ الفُقَهاء في ترتيبهم لكُتُب الفِقه؛ حيث بدأ كتابَه كعادة المتقدِّمين بالطهارة، ثم الصلاة، ثم الجنائز، ثم الزكاة، ثم الصيام، ثم الحج، ثم البيوع، ثم النكاح، ثم الجنايات، ثم الحدود، ثم الجهاد، ثم الأطعمة، وجعَل آخِرَه بابًا جامعًا سمَّاه: الجامِع في الآداب، حيث ضمَّنه نُخبةً طيِّبة مِنَ الأحاديث في الأخلاق والسلوك، والذِّكر والدعاء. وقد اهتَمَّ ابنُ حجرٍ بتوضيح درجةِ الحديث من حيثُ الصحةُ والضعْف، وكثيرًا ما كان يُصدِّر الباب الذي يتناوَله بما في الصحيحين أو أحدهما، وإذا كان للحديثِ مُتابعاتٌ أو شواهِدُ أشارَ إليها. وقدِ اشتَملَ الكتاب على "1596" حديثًا، وهو عددٌ كبير أعْطَى الكتاب ثقلاً من حيثُ الأهميَّة، وربَّما كان السببُ في زيادة عددِ الأحاديث في هذا الكتاب هو أنَّ ابن حجرٍ كان يُورِد كلَّ ما في الباب الذي يَتناوَله من أحاديثَ، مع بيانِ الضعيف، وهذا على عكسِ كتاب "الإلمام"؛ لابن دقيق، حيث اشترَط مؤلِّفه ألاَّ يورد إلا ما صَحَّ. وكان الشيخ العلامة الألباني يمدَح الكتاب ويُوصِي به الطلَبَة، ويقول - رحمه الله -: "مِن أحسن الكُتب المصنَّفة في أدلَّة الأحكام كتابُ الحافظ ابن حجرٍ "بلوغ المرام"، وقد أشار مؤلِّفه إلى الأحاديث صِحَّةً وضعفًا... ". ونظَرًا لأهميَّة الكتاب الكبيرة، فقد اهتَمَّ به العلماءُ مِن قديم الزمان بالحفظ والشَّرْح، وقد طُبِع عدَّة طبعات. أمَّا شُروح العلماء له، فكثيرةٌ، ومنها: 1- البدر التمام في شرح بلوغ المرام؛ للشيخ القاضي الحسين بن محمَّد المغربي المتوفَّى سنة (1119هـ)، قامتْ بنشْر قسمٍ منه مكتبةُ العبيكان في الرياض، عام 1414 هـ، وجاء هذا القِسْم في مجلدين يحتويان على الجزء مِن أوَّل الكتاب إلى باب صِفة الصلاة، بتحقيق الشيخ: على بن عبدالله الزبت. 2- سُبل السلام في شرح بلوغ المرام من أدلة الأحكام؛ للشيخ محمد بن إسماعيل الأمير الصنعاني، المتوفَّى عام 1182 هـ، وقد اختَصرَه مِن شرح العلاَّمة شرف الدين الحسين بن محمد المغربي سابق الذِّكْر، وقد طُبِع عدَّة مرَّات، منها: أ- طبعة المطبعة المنيرية في مصر. ب- طبعة المطبع الفاروقي الواقِع في دهلي بالهند سنة 1311 هـ في مجلَّد كبير. جـ- طبعة جامعة الإمام محمد بن سعود الإسلامية كلية الشريعة، في أربعة مجلَّدات، دون تاريخ. د- طبعة دار الكُتب العربية سنة 1405هـ، في أربعة مجلَّدات باعتناء الشيخَيْن فواز أحمد زمرلي، وإبراهيم محمد الجمل. هـ- طبعة دار ابن الجوزي للنشر والتوزيع، بتعليق وتحقيق وتخريج الشيخ: محمد صبحي حلاق، في ثمانية مجلدات، وأثبَتَ المحقِّق على طرَّة الكتاب اسم الشرح "سبل السلام الموصلة إلى بلوغ المرام"، بِناءً على ما أثبت على إحْدى النُّسختين المخطوطتين اللَّتَيْن اعتَمَد عليهما في التحقيق. و- "مسك الختام"؛ للشيخ صديق بن حسن خان البخاري القنوجي، المتوفَّى سنة (1307) باللُّغة الفارسيَّة، وهو - مِن وجهة نظرِه - من أحسنِ الكُتب التي ألَّفها، حيث ذكَر ذلك في كتابه "إتحاف النبلاء المتَّقين بإحياء مَآثِر الفقهاء والمحدِّثين"، وهو باللغة الفارسيَّة أيضًا. ز- فتْح العلام لشرح بلوغ المرام؛ لأبي الخير نور الحسن بن صديق بن حسان خان، المتوفَّى سنة 1336 هـ، ومعظمه مِن "سبل السلام" مع زياداتٍ من غيره، ولا سيَّما في المجلد الثاني، وقد طُبِع في المطبعة الأميرية في بولاق بمصر الطبعة الأولى سنة 1302 هـ، ثم صوَّرته دارُ صادر في بيروت بعد ذلك بدون تاريخ. 5- مُختصر الكلام على بلوغ المرام؛ للشيخ فيصل بن عبدالعزيز آل مبارك، المتوفَّى سنة 1376 هـ، وقد نشرَتْه المكتبة الأهليَّة في الرياض ضمنَ المجموعة الجليلة، وهي عبارةٌ عن ثلاثة كتب للمؤلِّف المذكور، وهذا الشَّرْح أوَّلها، ثم طُبِعتْ هذه المجموعة بعدَ ذلك عِدَّة مرَّات. 6- فقه الإسلام شرح بلوغ المرام؛ للشيخ عبدالقادر شيبة الحمد، وقد طُبِع في مطابع الرشيد بالمدينة المنورة في عشرة أجزاء، دون تاريخ. 7- نيل المرام شرح بلوغ المرام من أدلَّة الأحكام، تأليف الشيخ محمد بن ياسين بن عبدالله مِن علماء الموصل، وقد طُبِع في مطبعة الزهراء الحديثة في الموصل سنة (1983 م)، في خمسة أجزاء، كما نشرتْه مكتبة بسَّام في الموصل سنة (1405 هـ)، وكذلك المكتبة التجارية في مكة المكرمة سنة (1412 هـ). 8- توضيح الأحكام من بلوغ المرام؛ للشيخ عبدالله بن عبدالرحمن البسَّام، وقد قامتْ بنشره مكتبةُ دار القبلة للثقافة الإسلاميَّة بجدة، الطبعة الأولى سنة (1413هـ)، في ستَّة مجلدات، ثم قام المؤلِّف بطبعه مرَّة ثانية سَنَة 1414 هـ، طبعة مصحَّحة محقَّقة، أضافَ فيها زياداتٍ مهمَّة، أشارَ إليها في المقدمة. 9- إتحاف الكِرام تعليق على بلوغ المرام؛ للشيخ صفي الرحمن المباركفوري، وقد طُبِع في المطبعة السلفيَّة في بنارس بالهند، الطبعة الأولى سنة 1403 هـ، في مجلَّدٍ واحدٍ، كما نشرَتْه دار السلام في الرياض سنة 1412 هـ. 10- حاشية الدهلوي على بلوغ المرام؛ للشيخ أحمد بن حسن الدهلوي، المتوفَّى سنة 1338 م، وقد طُبعتْ سنة 1335هـ على الحجر في الهند، ثم قامَ المكتب الإسلامي بطبعها ثانيةً سنة 1394 هـ في مجلد. 11- فتح ذي الجلال والإكرام بشرح بلوغ المرام؛ لفضيلة الشيخ محمد بن صالِح العثيمين، وقد اعتنى به وخرَّج أحاديثه وفهرسَه الشيخ أحمد وسامي ابنا محمَّد بن حسن الخليل، حيث نشرتْه دار المسلم للنشر والتوزيع في الرياض، الطبعة الأولى سنة 1416 هـ، وقد صدَر منه الجزء الأول، وهو شرْحٌ لمقدمة المؤلف بالإضافةِ إلى الكتاب الأول فقط المسمَّى "كتاب الطهارة". 12- فتْح الوهاب شرْح على بلوغ المرام؛ للشيخ محمد أحمد الداه الشنقيطي، وقد نشرَتْه دار الفكر في بيروت سنة 1404 هـ. 13- شرَحه الشيخ إبراهيم بن أبي القاسم بن إبراهيم جعمان الذؤالي، المتوفَّى سنة 897 هـ. 14- وكذلك شرَحه سبطُه الحافظ جمال الدين يوسف بن شاهين، المتوفَّى سنة 899 هـ، وسمَّاه: "منحة الكرام بشرح بلوغ المرام". 15- شرح الشيخ عبدالرحمن بن محمد الحميمي اليمني المتوفَّى سنة 1068 هـ. 16- تنبيه الكِرام على أحاديثَ في بلوغ المرام؛ تأليف الشيخ عبدالله بن صالح العبيلان، وهي رسالةٌ في "32" صفحة، فيها بعضُ الملحوظات والتنبيهات المهمَّة. 17- وحي الكلام مِن بلوغ المرام؛ للشيخ شاكر بن محمود، طُبع في المطبعة العمارية سنة 1348 هـ في "92" صفحة. [التعريف بالكتاب ، نقلاً عن موقع : الألوكة]

# aladabAlmufradBookDescription
source: will add soon..
ar: (المؤلف) الإمام الحافظ محمد بن إسماعيل بن إبراهيم البخاري (194 هـ - 256 هـ) اسم الكتاب الذي طبع به، ووصف أشهر طبعاته: 1- طبع باسم: الأدب المفرد حقق نصوصه ورقم أبوابه وأحاديثه وعلق عليه محمد فؤاد عبد الباقي، وصدر عن المطبعة السلفية ومكتبتها بالقاهرة, سنة 1375 هـ. 2- طبع بنفس الاسم، تحقيق وشرح عارف الكندي, صدر دار الإرشاد بحمص, سنة 1392 هـ. 3- طبع بنفس الاسم، حققه وقابله على أصوله سمير بن أمين الزهيري مستفيدا من تخريجات وتعليقات العلامة الشيخ المحدث محمد ناصر الدين الألباني (توثيق نسبة الكتاب إلى مؤلفه) في اللوحة الأولى من النسخة المخطوطة المحفوظ في مكتبة عارف حكمت , أن الحافظ ابن حجر ذكره في فتح الباري وذكر نعته وفوائده , وهو كتاب مشهور غني عن التعريف به وتوثيق نسبته إلى مؤلفه فكثيرا ما يعزو إليه الحافظ ابن حجر في الفتح وفي التهذيب وفي تعجيل المنفعة وأيضا في الإصابة والدراية في تخريج أحاديث الهداية وفي التلخيص الحبير وفي تغليق التعليق وذكره غير الحافظ جمع من الأئمة مثل العظيم آبادي والمباركفوري والمنذري والسيوطي وغيرهم 4 (وصف الكتاب ومنهجه) جمع الإمام البخاري في هذا الكتاب جل الآداب التي أمر وحبب فيها النبي صلى الله عليه وسلم منها ما هو واجب ومنها ما هو دون ذلك وأيضا الأمور المنهي عنها كالنهي عن كثرة الضحك والظلم والكذب والشبع دون الجار إلى غير ذلك , وهو لا يقسم كتابه هذا إلى عدة كتب ثم إلى أبواب كما يفعل في الصحيح ولكنها أبواب مختلفة وكل باب يندرج تحته عدة أحاديث , وأحيانا يفعل الإمام مثل ما يفعل في الصحيح من إيراد الحديث في أكثر من موضع فهناك مثلا حديث " تحاج الجنة والنار " أورده الإمام في باب الكبر وأيضا في باب البغي . [التعريف بالكتاب ، نقلاً عن موقع : جامع الحديث]

# darimiBookDescription
source: will add soon..
ar: اسم الكتاب ومؤلفه: هو أبو محمد عبد الله بن عبد الرحمن الدارمي ولقد ورد لكتابه عدة تسميات منها الصحيح والمسند ولقد شاعت تسمية المسند على كتاب الدارمي أكثر من غيرها من الأسماء وعلماء آخرين أطلقوا عليه اسم السنن كما سماه بعض العلماء المتأخرين اسما مركبا فقد سماه عبد الصاحب الدجيلي "الجامع الصحيح في السنن". عدد حديثه: اشتمل سنن الدارمي على أحاديث كثيرة عدها بعضهم (3455) نصا مسندا في مختلف الأبواب الفقهية وعدد الكتب لديه (24) كتابا وعدد الأبواب (1582). موضوع الكتاب ومنهجه: 1- بدأ الإمام الدارمي كتابه بمقدمة اشتملت من المعجزات التي أكرم بها النبي r ، كما اشتملت على موضوعات أخرى تتعلق بالعلم بشكل عام وبما يتعلق بعلوم الحديث بشكل خاص من حيث تدوينه وروايته وفضل علماء الحديث على غيرهم، وغير ذلك من الموضوعات التي لها علاقة بعلم الحديث. 2- رتب الإمام الدارمي كتابه المسند على الأبواب الفقهية على خلاف ظاهر اسمه وقسم كتابه المسند إلى مقدمة وثلاثة وعشرين كتابا وقد سمى المواضيع الرئيسة بالكتب على عادة المصنفين في العهود السابقة – ثم قسم الموضوع الرئيس إلى أجزاء وسمى كل جزء منها بابا. 3- لقد دمج الإمام الدارمي في مسنده الكتب بعضها في بعض ولهذا نجد أن عدد الكتب في مسنده أقل منها في أي من الكتب الستة. 4- لقد أكثر الإمام الدارمي في مسنده من تفريع الأبواب فنجدها في بعض الكتب بالمئات وانعكس هذا على عدد من الأحاديث في الباب الواحد فتجدها قليلة وكثيرا ما تكون الترجمة لحديث واحد. 5- كان مقصد الإمام الدارمي في مسنده الاستنباط الفقهي ويلاحظ ذلك من التكرار بين الأبواب. 6- لقد جمع الإمام الدارمي في مسنده بين الغرض الفقهي والفرضي الإسنادي فنجده كثيرا ما يسرد الطرق المتعددة للحديث وكذلك نجده أيضا يتتبع الآراء المختلفة في المسألة الواحدة سعيا وراء الحكم الفقهي فيها. 7- لقد تميز منهج الإمام الدارمي في كتابه بتكراره للأحاديث واختصارها وتقطيعها على الأبواب المختلفة والتكرار إما يكون لغرض إسنادي أو لغرض يتعلق بالمتن أو لغرض يتعلق بالاستنباط والاستدلال الفقهي. ثناء العلماء على الكتاب: لقد أثنى كثير من العلماء على مسند الدارمي ووصفوه بأنه عالي الإسناد وكما امتدحوه بكثرة ثلاثياته وقالوا أنها أكثر من ثلاثيات البخاري وممن أثنى عليه الإمام الذهبي حيث قال في ترجمة الدارمي: " الدارمي السمرقندي صاحب المسند العالي الذي في طبقة منتخب مسند عبد بن حميد" وقد عده بعض العلماء سادسا للكتب الستة مقدما له على سنن ابن ماجه كالحافظ ابن حجر، وصلاح الدين العلائي وابن الصلاح والنووي وغيرهم. شروح الكتاب: فتح المنان شرح كتاب الدارمي لنبيل هاشم الغمري. [التعريف بالكتاب ، نقلا عن موقع : داريا]
